[Killed] BlockStatement
lib.js:48:26
  * @param {string|null|undefined} str - String to escape
  * @returns {string} HTML-safe string
  */
-function escapeHtml(str) {
-  if (str === null || str === undefined) return "";
-  const map = {
-    "&": "&amp;",
-    "<": "&lt;",
-    ">": "&gt;",
-    '"': "&quot;",
-    "'": "&#039;",
-  };
-  return String(str).replace(/[&<>"']/g, (c) => map[c]);
-}
+function escapeHtml(str) {}
 
 /**
killedBy: escapeHtml escapes ampersand to &amp;
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a &amp; b"
Received: undefined

[Killed] EqualityOperator
lib.js:49:7
  * @returns {string} HTML-safe string
  */
 function escapeHtml(str) {
-  if (str === null || str === undefined) return "";
+  if (str !== null || str === undefined) return "";
   const map = {
     "&": "&amp;",
killedBy: escapeHtml escapes ampersand to &amp;
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a &amp; b"
Received: ""

[Killed] EqualityOperator
lib.js:49:23
  * @returns {string} HTML-safe string
  */
 function escapeHtml(str) {
-  if (str === null || str === undefined) return "";
+  if (str === null || str !== undefined) return "";
   const map = {
     "&": "&amp;",
killedBy: escapeHtml escapes ampersand to &amp;
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a &amp; b"
Received: ""

[Killed] ObjectLiteral
lib.js:50:15
  */
 function escapeHtml(str) {
   if (str === null || str === undefined) return "";
-  const map = {
-    "&": "&amp;",
-    "<": "&lt;",
-    ">": "&gt;",
-    '"': "&quot;",
-    "'": "&#039;",
-  };
+  const map = {};
   return String(str).replace(/[&<>"']/g, (c) => map[c]);
 }
killedBy: escapeHtml escapes ampersand to &amp;
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a &amp; b"
Received: "a undefined b"

[Killed] StringLiteral
lib.js:51:10
 function escapeHtml(str) {
   if (str === null || str === undefined) return "";
   const map = {
-    "&": "&amp;",
+    "&": "",
     "<": "&lt;",
     ">": "&gt;",
killedBy: escapeHtml escapes ampersand to &amp;
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a &amp; b"
Received: "a  b"

[Killed] StringLiteral
lib.js:52:10
   if (str === null || str === undefined) return "";
   const map = {
     "&": "&amp;",
-    "<": "&lt;",
+    "<": "",
     ">": "&gt;",
     '"': "&quot;",
killedBy: escapeHtml escapes less-than to &lt;
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "&lt;script&gt;"
Received: "script&gt;"

[Killed] ArrowFunction
lib.js:57:42
     '"': "&quot;",
     "'": "&#039;",
   };
-  return String(str).replace(/[&<>"']/g, (c) => map[c]);
+  return String(str).replace(/[&<>"']/g, () => undefined);
 }
 
killedBy: escapeHtml escapes ampersand to &amp;
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a &amp; b"
Received: "a undefined b"

[Killed] Regex
lib.js:57:30
     '"': "&quot;",
     "'": "&#039;",
   };
-  return String(str).replace(/[&<>"']/g, (c) => map[c]);
+  return String(str).replace(/[^&<>"']/g, (c) => map[c]);
 }
 
killedBy: escapeHtml escapes ampersand to &amp;
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "a &amp; b"
Received: "undefinedundefined&undefinedundefined"

[Killed] BlockStatement
lib.js:65:31
  * @param {*} addr - Value to validate
  * @returns {boolean} True if valid 0x-prefixed 40-character hex string
  */
-function isValidAddress(addr) {
-  if (typeof addr !== "string") return false;
-  return /^0x[a-fA-F0-9]{40}$/.test(addr);
-}
+function isValidAddress(addr) {}
 
 /**
killedBy: isValidAddress requires 0x prefix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
lib.js:66:7
  * @returns {boolean} True if valid 0x-prefixed 40-character hex string
  */
 function isValidAddress(addr) {
-  if (typeof addr !== "string") return false;
+  if (true) return false;
   return /^0x[a-fA-F0-9]{40}$/.test(addr);
 }
killedBy: isValidAddress requires 0x prefix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
lib.js:66:7
  * @returns {boolean} True if valid 0x-prefixed 40-character hex string
  */
 function isValidAddress(addr) {
-  if (typeof addr !== "string") return false;
+  if (typeof addr === "string") return false;
   return /^0x[a-fA-F0-9]{40}$/.test(addr);
 }
killedBy: isValidAddress requires 0x prefix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
lib.js:67:10
  */
 function isValidAddress(addr) {
   if (typeof addr !== "string") return false;
-  return /^0x[a-fA-F0-9]{40}$/.test(addr);
+  return /^0x[a-fA-F0-9]$/.test(addr);
 }
 
killedBy: isValidAddress requires 0x prefix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] Regex
lib.js:67:10
  */
 function isValidAddress(addr) {
   if (typeof addr !== "string") return false;
-  return /^0x[a-fA-F0-9]{40}$/.test(addr);
+  return /^0x[^a-fA-F0-9]{40}$/.test(addr);
 }
 
killedBy: isValidAddress requires 0x prefix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
lib.js:75:32
  * @param {string} addr - Full Ethereum address
  * @returns {string} Full address or empty string if invalid
  */
-function truncateAddress(addr) {
-  if (!addr || !isValidAddress(addr)) return "";
-  return addr;
-}
+function truncateAddress(addr) {}
 
 /**
killedBy: truncateAddress returns full address for valid input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0xc02aaa39b223fe8d0a0e5c4f27ead9083c756cc2"
Received: undefined

[Killed] LogicalOperator
lib.js:76:7
  * @returns {string} Full address or empty string if invalid
  */
 function truncateAddress(addr) {
-  if (!addr || !isValidAddress(addr)) return "";
+  if (!addr && !isValidAddress(addr)) return "";
   return addr;
 }
killedBy: truncateAddress returns empty string for invalid address
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "invalid"

[Killed] ConditionalExpression
lib.js:76:7
  * @returns {string} Full address or empty string if invalid
  */
 function truncateAddress(addr) {
-  if (!addr || !isValidAddress(addr)) return "";
+  if (false) return "";
   return addr;
 }
killedBy: truncateAddress returns empty string for invalid address
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "invalid"

[Killed] BlockStatement
lib.js:86:35
  * @param {string} hash - URL hash
  * @returns {string|null} Order ID or null
  */
-function getOrderIdFromHash(hash) {
-  if (!hash) return null;
-
-  const dashMatch = hash.match(/^#order-(\d+)$/);
-  if (dashMatch) return dashMatch[1];
-
-  const orderMatch = hash.match(/^#order=(\d+)$/);
-  if (orderMatch) return orderMatch[1];
-
-  const simpleMatch = hash.match(/^#(\d+)$/);
-  if (simpleMatch) return simpleMatch[1];
-
-  return null;
-}
+function getOrderIdFromHash(hash) {}
 
 /**
killedBy: getOrderIdFromHash parses #order-{id} format with exact match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "123"
Received: undefined

[Killed] ConditionalExpression
lib.js:87:7
  * @returns {string|null} Order ID or null
  */
 function getOrderIdFromHash(hash) {
-  if (!hash) return null;
+  if (true) return null;
 
   const dashMatch = hash.match(/^#order-(\d+)$/);
killedBy: getOrderIdFromHash parses #order-{id} format with exact match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "123"
Received: null

[Killed] BooleanLiteral
lib.js:87:7
  * @returns {string|null} Order ID or null
  */
 function getOrderIdFromHash(hash) {
-  if (!hash) return null;
+  if (hash) return null;
 
   const dashMatch = hash.match(/^#order-(\d+)$/);
killedBy: getOrderIdFromHash parses #order-{id} format with exact match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "123"
Received: null

[Killed] Regex
lib.js:89:32
 function getOrderIdFromHash(hash) {
   if (!hash) return null;
 
-  const dashMatch = hash.match(/^#order-(\d+)$/);
+  const dashMatch = hash.match(/^#order-(\d+)/);
   if (dashMatch) return dashMatch[1];
 
killedBy: getOrderIdFromHash only matches numeric order IDs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "12"

[Killed] ConditionalExpression
lib.js:90:7
   if (!hash) return null;
 
   const dashMatch = hash.match(/^#order-(\d+)$/);
-  if (dashMatch) return dashMatch[1];
+  if (false) return dashMatch[1];
 
   const orderMatch = hash.match(/^#order=(\d+)$/);
killedBy: getOrderIdFromHash parses #order-{id} format with exact match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "123"
Received: null

[Killed] ConditionalExpression
lib.js:90:7
   if (!hash) return null;
 
   const dashMatch = hash.match(/^#order-(\d+)$/);
-  if (dashMatch) return dashMatch[1];
+  if (true) return dashMatch[1];
 
   const orderMatch = hash.match(/^#order=(\d+)$/);
killedBy: getOrderIdFromHash parses #order-{id} format with exact match
statusReason: TypeError: Cannot read properties of null (reading '1')

[Killed] ConditionalExpression
lib.js:93:7
   if (dashMatch) return dashMatch[1];
 
   const orderMatch = hash.match(/^#order=(\d+)$/);
-  if (orderMatch) return orderMatch[1];
+  if (false) return orderMatch[1];
 
   const simpleMatch = hash.match(/^#(\d+)$/);
killedBy: getOrderIdFromHash parses #order={id} format for backwards compatibility
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "456"
Received: null

[Killed] ConditionalExpression
lib.js:93:7
   if (dashMatch) return dashMatch[1];
 
   const orderMatch = hash.match(/^#order=(\d+)$/);
-  if (orderMatch) return orderMatch[1];
+  if (true) return orderMatch[1];
 
   const simpleMatch = hash.match(/^#(\d+)$/);
killedBy: getOrderIdFromHash parses #order-{id} format with exact match
statusReason: TypeError: Cannot read properties of null (reading '1')

[Killed] ConditionalExpression
lib.js:96:7
   if (orderMatch) return orderMatch[1];
 
   const simpleMatch = hash.match(/^#(\d+)$/);
-  if (simpleMatch) return simpleMatch[1];
+  if (false) return simpleMatch[1];
 
   return null;
killedBy: getOrderIdFromHash parses #{id} simple format
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "789"
Received: null

[Killed] ConditionalExpression
lib.js:96:7
   if (orderMatch) return orderMatch[1];
 
   const simpleMatch = hash.match(/^#(\d+)$/);
-  if (simpleMatch) return simpleMatch[1];
+  if (true) return simpleMatch[1];
 
   return null;
killedBy: getOrderIdFromHash parses #order-{id} format with exact match
statusReason: TypeError: Cannot read properties of null (reading '1')

[Killed] BlockStatement
lib.js:107:45
  * @param {string} baseUrl - Base URL
  * @returns {string} Full URL with hash
  */
-function getOrderShareUrl(orderId, baseUrl) {
-  const url = new URL(baseUrl);
-  url.hash = "order-" + orderId;
-  return url.toString();
-}
+function getOrderShareUrl(orderId, baseUrl) {}
 
 // ============================================================================
killedBy: getOrderShareUrl creates URL with #order-{id} hash format
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://example.com/#order-123"
Received: undefined

[Killed] StringLiteral
lib.js:109:14
  */
 function getOrderShareUrl(orderId, baseUrl) {
   const url = new URL(baseUrl);
-  url.hash = "order-" + orderId;
+  url.hash = "" + orderId;
   return url.toString();
 }
killedBy: getOrderShareUrl creates URL with #order-{id} hash format
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://example.com/#order-123"
Received: "https://example.com/#123"

[Killed] BlockStatement
lib.js:122:30
  * @param {number|null} usdValue
  * @returns {string}
  */
-function formatUsd(usdValue) {
-  if (usdValue === null || usdValue === undefined) return "$ --";
-  if (usdValue >= 1000000) {
-    return "$ " + (usdValue / 1000000).toFixed(2) + "M";
-  }
-  if (usdValue >= 1000) {
-    return "$ " + usdValue.toFixed(0).replace(/\B(?=(\d{3})+(?!\d))/g, ",");
-  }
-  if (usdValue >= 1) {
-    return "$ " + usdValue.toFixed(2);
-  }
-  if (usdValue >= 0.01) {
-    return "$ " + usdValue.toFixed(4);
-  }
-  return "$ " + usdValue.toExponential(2);
-}
+function formatUsd(usdValue) {}
 
 /**
killedBy: formatUsd returns $ -- for null
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "$ --"
Received: undefined

[Killed] ConditionalExpression
lib.js:123:7
  * @returns {string}
  */
 function formatUsd(usdValue) {
-  if (usdValue === null || usdValue === undefined) return "$ --";
+  if (true) return "$ --";
   if (usdValue >= 1000000) {
     return "$ " + (usdValue / 1000000).toFixed(2) + "M";
killedBy: formatUsd formats values >= 1M with M suffix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "$ 1.00M"
Received: "$ --"

[Killed] LogicalOperator
lib.js:123:7
  * @returns {string}
  */
 function formatUsd(usdValue) {
-  if (usdValue === null || usdValue === undefined) return "$ --";
+  if (usdValue === null && usdValue === undefined) return "$ --";
   if (usdValue >= 1000000) {
     return "$ " + (usdValue / 1000000).toFixed(2) + "M";
killedBy: formatUsd returns $ -- for null
statusReason: TypeError: Cannot read properties of null (reading 'toExponential')

[Killed] EqualityOperator
lib.js:124:7
  */
 function formatUsd(usdValue) {
   if (usdValue === null || usdValue === undefined) return "$ --";
-  if (usdValue >= 1000000) {
+  if (usdValue < 1000000) {
     return "$ " + (usdValue / 1000000).toFixed(2) + "M";
   }
killedBy: formatUsd formats values >= 1M with M suffix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "$ 1.00M"
Received: "$ 1,000,000"

[Killed] EqualityOperator
lib.js:124:7
  */
 function formatUsd(usdValue) {
   if (usdValue === null || usdValue === undefined) return "$ --";
-  if (usdValue >= 1000000) {
+  if (usdValue > 1000000) {
     return "$ " + (usdValue / 1000000).toFixed(2) + "M";
   }
killedBy: formatUsd formats values >= 1M with M suffix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "$ 1.00M"
Received: "$ 1,000,000"

[Killed] ArithmeticOperator
lib.js:125:20
 function formatUsd(usdValue) {
   if (usdValue === null || usdValue === undefined) return "$ --";
   if (usdValue >= 1000000) {
-    return "$ " + (usdValue / 1000000).toFixed(2) + "M";
+    return "$ " + (usdValue * 1000000).toFixed(2) + "M";
   }
   if (usdValue >= 1000) {
killedBy: formatUsd formats values >= 1M with M suffix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "$ 1.00M"
Received: "$ 1000000000000.00M"

[Killed] StringLiteral
lib.js:125:12
 function formatUsd(usdValue) {
   if (usdValue === null || usdValue === undefined) return "$ --";
   if (usdValue >= 1000000) {
-    return "$ " + (usdValue / 1000000).toFixed(2) + "M";
+    return "" + (usdValue / 1000000).toFixed(2) + "M";
   }
   if (usdValue >= 1000) {
killedBy: formatUsd formats values >= 1M with M suffix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "$ 1.00M"
Received: "1.00M"

[Killed] EqualityOperator
lib.js:127:7
   if (usdValue >= 1000000) {
     return "$ " + (usdValue / 1000000).toFixed(2) + "M";
   }
-  if (usdValue >= 1000) {
+  if (usdValue > 1000) {
     return "$ " + usdValue.toFixed(0).replace(/\B(?=(\d{3})+(?!\d))/g, ",");
   }
killedBy: formatUsd formats values >= 1000 with comma separators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "$ 1,000"
Received: "$ 1000.00"

[Killed] ConditionalExpression
lib.js:127:7
   if (usdValue >= 1000000) {
     return "$ " + (usdValue / 1000000).toFixed(2) + "M";
   }
-  if (usdValue >= 1000) {
+  if (true) {
     return "$ " + usdValue.toFixed(0).replace(/\B(?=(\d{3})+(?!\d))/g, ",");
   }
killedBy: formatUsd formats values >= 1 with 2 decimal places
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "$ 5.50"
Received: "$ 6"

[Killed] StringLiteral
lib.js:128:72
     return "$ " + (usdValue / 1000000).toFixed(2) + "M";
   }
   if (usdValue >= 1000) {
-    return "$ " + usdValue.toFixed(0).replace(/\B(?=(\d{3})+(?!\d))/g, ",");
+    return "$ " + usdValue.toFixed(0).replace(/\B(?=(\d{3})+(?!\d))/g, "");
   }
   if (usdValue >= 1) {
killedBy: formatUsd formats values >= 1M with M suffix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "$ 999,999"
Received: "$ 999999"

[Killed] Regex
lib.js:128:47
     return "$ " + (usdValue / 1000000).toFixed(2) + "M";
   }
   if (usdValue >= 1000) {
-    return "$ " + usdValue.toFixed(0).replace(/\B(?=(\d{3})+(?!\d))/g, ",");
+    return "$ " + usdValue.toFixed(0).replace(/\B(?!(\d{3})+(?!\d))/g, ",");
   }
   if (usdValue >= 1) {
killedBy: formatUsd formats values >= 1M with M suffix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "$ 999,999"
Received: "$ 9,9,99,9,9"

[Killed] BlockStatement
lib.js:130:22
   if (usdValue >= 1000) {
     return "$ " + usdValue.toFixed(0).replace(/\B(?=(\d{3})+(?!\d))/g, ",");
   }
-  if (usdValue >= 1) {
-    return "$ " + usdValue.toFixed(2);
-  }
+  if (usdValue >= 1) {}
   if (usdValue >= 0.01) {
     return "$ " + usdValue.toFixed(4);
killedBy: formatUsd formats values >= 1 with 2 decimal places
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "$ 5.50"
Received: "$ 5.5000"

[Killed] EqualityOperator
lib.js:130:7
   if (usdValue >= 1000) {
     return "$ " + usdValue.toFixed(0).replace(/\B(?=(\d{3})+(?!\d))/g, ",");
   }
-  if (usdValue >= 1) {
+  if (usdValue > 1) {
     return "$ " + usdValue.toFixed(2);
   }
killedBy: formatUsd formats values >= 1 with 2 decimal places
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "$ 1.00"
Received: "$ 1.0000"

[Killed] BlockStatement
lib.js:133:25
   if (usdValue >= 1) {
     return "$ " + usdValue.toFixed(2);
   }
-  if (usdValue >= 0.01) {
-    return "$ " + usdValue.toFixed(4);
-  }
+  if (usdValue >= 0.01) {}
   return "$ " + usdValue.toExponential(2);
 }
killedBy: formatUsd formats values >= 0.01 with 4 decimal places
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "$ 0.0100"
Received: "$ 1.00e-2"

[Killed] EqualityOperator
lib.js:133:7
   if (usdValue >= 1) {
     return "$ " + usdValue.toFixed(2);
   }
-  if (usdValue >= 0.01) {
+  if (usdValue < 0.01) {
     return "$ " + usdValue.toFixed(4);
   }
killedBy: formatUsd formats values >= 0.01 with 4 decimal places
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "$ 0.0100"
Received: "$ 1.00e-2"

[Killed] StringLiteral
lib.js:134:12
     return "$ " + usdValue.toFixed(2);
   }
   if (usdValue >= 0.01) {
-    return "$ " + usdValue.toFixed(4);
+    return "" + usdValue.toFixed(4);
   }
   return "$ " + usdValue.toExponential(2);
killedBy: formatUsd formats values >= 0.01 with 4 decimal places
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "$ 0.0100"
Received: "0.0100"

[Killed] StringLiteral
lib.js:136:10
   if (usdValue >= 0.01) {
     return "$ " + usdValue.toFixed(4);
   }
-  return "$ " + usdValue.toExponential(2);
+  return "" + usdValue.toExponential(2);
 }
 
killedBy: formatUsd formats values < 0.01 in scientific notation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "$ 1.00e-3"
Received: "1.00e-3"

[Killed] BlockStatement
lib.js:145:41
  * @param {number} decimals - Token decimals
  * @returns {string} Human-readable amount
  */
-function formatAmount(amount, decimals) {
-  const bn = BigInt(amount);
-  const divisor = BigInt(10 ** decimals);
-  const whole = bn / divisor;
-  const fraction = bn % divisor;
-  const fractionStr = fraction.toString().padStart(decimals, "0").slice(0, 4);
-  return formatNumber(Number(whole)) + (fractionStr !== "0000" ? "." + fractionStr.replace(/0+$/, "") : "");
-}
+function formatAmount(amount, decimals) {}
 
 /**
killedBy: formatAmount divides by 10^decimals
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: undefined

[Killed] ArithmeticOperator
lib.js:148:17
 function formatAmount(amount, decimals) {
   const bn = BigInt(amount);
   const divisor = BigInt(10 ** decimals);
-  const whole = bn / divisor;
+  const whole = bn * divisor;
   const fraction = bn % divisor;
   const fractionStr = fraction.toString().padStart(decimals, "0").slice(0, 4);
killedBy: formatAmount divides by 10^decimals
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: "1e+36"

[Killed] ArithmeticOperator
lib.js:149:20
   const bn = BigInt(amount);
   const divisor = BigInt(10 ** decimals);
   const whole = bn / divisor;
-  const fraction = bn % divisor;
+  const fraction = bn * divisor;
   const fractionStr = fraction.toString().padStart(decimals, "0").slice(0, 4);
   return formatNumber(Number(whole)) + (fractionStr !== "0000" ? "." + fractionStr.replace(/0+$/, "") : "");
killedBy: formatAmount divides by 10^decimals
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: "1.1"

[Killed] MethodExpression
lib.js:150:23
   const divisor = BigInt(10 ** decimals);
   const whole = bn / divisor;
   const fraction = bn % divisor;
-  const fractionStr = fraction.toString().padStart(decimals, "0").slice(0, 4);
+  const fractionStr = fraction.toString().padStart(decimals, "0");
   return formatNumber(Number(whole)) + (fractionStr !== "0000" ? "." + fractionStr.replace(/0+$/, "") : "");
 }
killedBy: formatAmount divides by 10^decimals
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: "1."

[Killed] ConditionalExpression
lib.js:151:41
   const whole = bn / divisor;
   const fraction = bn % divisor;
   const fractionStr = fraction.toString().padStart(decimals, "0").slice(0, 4);
-  return formatNumber(Number(whole)) + (fractionStr !== "0000" ? "." + fractionStr.replace(/0+$/, "") : "");
+  return formatNumber(Number(whole)) + (true ? "." + fractionStr.replace(/0+$/, "") : "");
 }
 
killedBy: formatAmount divides by 10^decimals
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: "1."

[Killed] ArithmeticOperator
lib.js:151:10
   const whole = bn / divisor;
   const fraction = bn % divisor;
   const fractionStr = fraction.toString().padStart(decimals, "0").slice(0, 4);
-  return formatNumber(Number(whole)) + (fractionStr !== "0000" ? "." + fractionStr.replace(/0+$/, "") : "");
+  return formatNumber(Number(whole)) - (fractionStr !== "0000" ? "." + fractionStr.replace(/0+$/, "") : "");
 }
 
killedBy: formatAmount divides by 10^decimals
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: 1

[Killed] BlockStatement
lib.js:159:28
  * @param {number} num - Number to format
  * @returns {string}
  */
-function formatNumber(num) {
-  return num.toString().replace(/\B(?=(\d{3})+(?!\d))/g, ",");
-}
+function formatNumber(num) {}
 
 /**
killedBy: formatAmount divides by 10^decimals
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: "undefined"

[Killed] Regex
lib.js:160:33
  * @returns {string}
  */
 function formatNumber(num) {
-  return num.toString().replace(/\B(?=(\d{3})+(?!\d))/g, ",");
+  return num.toString().replace(/\B(?=(\D{3})+(?!\d))/g, ",");
 }
 
killedBy: formatAmount adds comma separators to large whole numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1,000,000"
Received: "1000000"

[Killed] Regex
lib.js:160:33
  * @returns {string}
  */
 function formatNumber(num) {
-  return num.toString().replace(/\B(?=(\d{3})+(?!\d))/g, ",");
+  return num.toString().replace(/\B(?=(\d{3})+(?!\D))/g, ",");
 }
 
killedBy: formatAmount adds comma separators to large whole numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1,000,000"
Received: "1,0,0,0,000"

[Killed] BlockStatement
lib.js:168:35
  * @param {number} timestamp - Unix timestamp in seconds
  * @returns {string} Relative time string
  */
-function formatTimeAgo(timestamp) {
-  const now = Math.floor(Date.now() / 1000);
-  const diff = now - timestamp;
-
-  if (diff < 60) return "just now";
-  if (diff < 3600) return Math.floor(diff / 60) + "m ago";
-  if (diff < 86400) return Math.floor(diff / 3600) + "h ago";
-  if (diff < 604800) return Math.floor(diff / 86400) + "d ago";
-
-  const date = new Date(timestamp * 1000);
-  return date.toLocaleDateString();
-}
+function formatTimeAgo(timestamp) {}
 
 /**
killedBy: formatTimeAgo shows just now for timestamps within 60 seconds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "just now"
Received: undefined

[Killed] ArithmeticOperator
lib.js:169:26
  * @returns {string} Relative time string
  */
 function formatTimeAgo(timestamp) {
-  const now = Math.floor(Date.now() / 1000);
+  const now = Math.floor(Date.now() * 1000);
   const diff = now - timestamp;
 
killedBy: formatTimeAgo shows just now for timestamps within 60 seconds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "just now"
Received: "1/8/2026"

[Killed] ArithmeticOperator
lib.js:170:16
  */
 function formatTimeAgo(timestamp) {
   const now = Math.floor(Date.now() / 1000);
-  const diff = now - timestamp;
+  const diff = now + timestamp;
 
   if (diff < 60) return "just now";
killedBy: formatTimeAgo shows just now for timestamps within 60 seconds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "just now"
Received: "1/8/2026"

[Killed] ConditionalExpression
lib.js:172:7
   const now = Math.floor(Date.now() / 1000);
   const diff = now - timestamp;
 
-  if (diff < 60) return "just now";
+  if (true) return "just now";
   if (diff < 3600) return Math.floor(diff / 60) + "m ago";
   if (diff < 86400) return Math.floor(diff / 3600) + "h ago";
killedBy: formatTimeAgo shows just now for timestamps within 60 seconds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1m ago"
Received: "just now"

[Killed] EqualityOperator
lib.js:172:7
   const now = Math.floor(Date.now() / 1000);
   const diff = now - timestamp;
 
-  if (diff < 60) return "just now";
+  if (diff >= 60) return "just now";
   if (diff < 3600) return Math.floor(diff / 60) + "m ago";
   if (diff < 86400) return Math.floor(diff / 3600) + "h ago";
killedBy: formatTimeAgo shows just now for timestamps within 60 seconds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "just now"
Received: "0m ago"

[Killed] EqualityOperator
lib.js:173:7
   const diff = now - timestamp;
 
   if (diff < 60) return "just now";
-  if (diff < 3600) return Math.floor(diff / 60) + "m ago";
+  if (diff >= 3600) return Math.floor(diff / 60) + "m ago";
   if (diff < 86400) return Math.floor(diff / 3600) + "h ago";
   if (diff < 604800) return Math.floor(diff / 86400) + "d ago";
killedBy: formatTimeAgo shows just now for timestamps within 60 seconds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1m ago"
Received: "0h ago"

[Killed] ConditionalExpression
lib.js:173:7
   const diff = now - timestamp;
 
   if (diff < 60) return "just now";
-  if (diff < 3600) return Math.floor(diff / 60) + "m ago";
+  if (false) return Math.floor(diff / 60) + "m ago";
   if (diff < 86400) return Math.floor(diff / 3600) + "h ago";
   if (diff < 604800) return Math.floor(diff / 86400) + "d ago";
killedBy: formatTimeAgo shows just now for timestamps within 60 seconds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1m ago"
Received: "0h ago"

[Killed] EqualityOperator
lib.js:174:7
 
   if (diff < 60) return "just now";
   if (diff < 3600) return Math.floor(diff / 60) + "m ago";
-  if (diff < 86400) return Math.floor(diff / 3600) + "h ago";
+  if (diff <= 86400) return Math.floor(diff / 3600) + "h ago";
   if (diff < 604800) return Math.floor(diff / 86400) + "d ago";
 
killedBy: formatTimeAgo shows days for timestamps 1-6 days ago
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1d ago"
Received: "24h ago"

[Killed] ArithmeticOperator
lib.js:174:39
 
   if (diff < 60) return "just now";
   if (diff < 3600) return Math.floor(diff / 60) + "m ago";
-  if (diff < 86400) return Math.floor(diff / 3600) + "h ago";
+  if (diff < 86400) return Math.floor(diff * 3600) + "h ago";
   if (diff < 604800) return Math.floor(diff / 86400) + "d ago";
 
killedBy: formatTimeAgo shows hours for timestamps 1-23 hours ago
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1h ago"
Received: "12960000h ago"
