[Killed] EqualityOperator
lib.js:175:7
   if (diff < 60) return "just now";
   if (diff < 3600) return Math.floor(diff / 60) + "m ago";
   if (diff < 86400) return Math.floor(diff / 3600) + "h ago";
-  if (diff < 604800) return Math.floor(diff / 86400) + "d ago";
+  if (diff >= 604800) return Math.floor(diff / 86400) + "d ago";
 
   const date = new Date(timestamp * 1000);
killedBy: formatTimeAgo shows days for timestamps 1-6 days ago
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1d ago"
Received: "1/7/2026"

[Killed] ArithmeticOperator
lib.js:175:40
   if (diff < 60) return "just now";
   if (diff < 3600) return Math.floor(diff / 60) + "m ago";
   if (diff < 86400) return Math.floor(diff / 3600) + "h ago";
-  if (diff < 604800) return Math.floor(diff / 86400) + "d ago";
+  if (diff < 604800) return Math.floor(diff * 86400) + "d ago";
 
   const date = new Date(timestamp * 1000);
killedBy: formatTimeAgo shows days for timestamps 1-6 days ago
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1d ago"
Received: "7464960000d ago"

[Killed] ArithmeticOperator
lib.js:177:25
   if (diff < 86400) return Math.floor(diff / 3600) + "h ago";
   if (diff < 604800) return Math.floor(diff / 86400) + "d ago";
 
-  const date = new Date(timestamp * 1000);
+  const date = new Date(timestamp / 1000);
   return date.toLocaleDateString();
 }
killedBy: formatTimeAgo multiplies timestamp by 1000 for Date constructor (* not /)
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /(2026|2025)/
Received string:  "12/31/1969"

[Killed] BlockStatement
lib.js:186:27
  * @param {number} num - Ratio value
  * @returns {string} Formatted ratio
  */
-function formatRatio(num) {
-  if (num === 0) return "0";
-  if (num >= 1000000) {
-    return (num / 1000000).toFixed(2) + "M";
-  }
-  if (num >= 1000) {
-    return num.toFixed(0).replace(/\B(?=(\d{3})+(?!\d))/g, ",");
-  }
-  if (num >= 1) {
-    return num.toFixed(4).replace(/\.?0+$/, "");
-  }
-  if (num >= 0.0001) {
-    return num.toFixed(6).replace(/\.?0+$/, "");
-  }
-  return num.toExponential(2);
-}
+function formatRatio(num) {}
 
 /**
killedBy: formatRatio returns 0 for zero value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: undefined

[Killed] ConditionalExpression
lib.js:187:7
  * @returns {string} Formatted ratio
  */
 function formatRatio(num) {
-  if (num === 0) return "0";
+  if (true) return "0";
   if (num >= 1000000) {
     return (num / 1000000).toFixed(2) + "M";
killedBy: formatRatio formats millions with M suffix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1.00M"
Received: "0"

[Killed] ConditionalExpression
lib.js:187:7
  * @returns {string} Formatted ratio
  */
 function formatRatio(num) {
-  if (num === 0) return "0";
+  if (false) return "0";
   if (num >= 1000000) {
     return (num / 1000000).toFixed(2) + "M";
killedBy: formatRatio returns 0 for zero value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0"
Received: "0.00e+0"

[Killed] BlockStatement
lib.js:188:23
  */
 function formatRatio(num) {
   if (num === 0) return "0";
-  if (num >= 1000000) {
-    return (num / 1000000).toFixed(2) + "M";
-  }
+  if (num >= 1000000) {}
   if (num >= 1000) {
     return num.toFixed(0).replace(/\B(?=(\d{3})+(?!\d))/g, ",");
killedBy: formatRatio formats millions with M suffix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1.00M"
Received: "1,000,000"

[Killed] EqualityOperator
lib.js:188:7
  */
 function formatRatio(num) {
   if (num === 0) return "0";
-  if (num >= 1000000) {
+  if (num < 1000000) {
     return (num / 1000000).toFixed(2) + "M";
   }
killedBy: formatRatio formats millions with M suffix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1.00M"
Received: "1,000,000"

[Killed] ArithmeticOperator
lib.js:189:13
 function formatRatio(num) {
   if (num === 0) return "0";
   if (num >= 1000000) {
-    return (num / 1000000).toFixed(2) + "M";
+    return (num * 1000000).toFixed(2) + "M";
   }
   if (num >= 1000) {
killedBy: formatRatio formats millions with M suffix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1.00M"
Received: "1000000000000.00M"

[Killed] EqualityOperator
lib.js:191:7
   if (num >= 1000000) {
     return (num / 1000000).toFixed(2) + "M";
   }
-  if (num >= 1000) {
+  if (num > 1000) {
     return num.toFixed(0).replace(/\B(?=(\d{3})+(?!\d))/g, ",");
   }
killedBy: formatRatio formats thousands with comma separators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1,000"
Received: "1000"

[Killed] BlockStatement
lib.js:191:20
   if (num >= 1000000) {
     return (num / 1000000).toFixed(2) + "M";
   }
-  if (num >= 1000) {
-    return num.toFixed(0).replace(/\B(?=(\d{3})+(?!\d))/g, ",");
-  }
+  if (num >= 1000) {}
   if (num >= 1) {
     return num.toFixed(4).replace(/\.?0+$/, "");
killedBy: formatRatio formats millions with M suffix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "999,999"
Received: "999999"

[Killed] Regex
lib.js:192:35
     return (num / 1000000).toFixed(2) + "M";
   }
   if (num >= 1000) {
-    return num.toFixed(0).replace(/\B(?=(\d{3})+(?!\d))/g, ",");
+    return num.toFixed(0).replace(/\B(?=(\d{3})+(?!\D))/g, ",");
   }
   if (num >= 1) {
killedBy: formatRatio formats millions with M suffix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "999,999"
Received: "9,9,9,999"

[Killed] StringLiteral
lib.js:192:60
     return (num / 1000000).toFixed(2) + "M";
   }
   if (num >= 1000) {
-    return num.toFixed(0).replace(/\B(?=(\d{3})+(?!\d))/g, ",");
+    return num.toFixed(0).replace(/\B(?=(\d{3})+(?!\d))/g, "");
   }
   if (num >= 1) {
killedBy: formatRatio formats millions with M suffix
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "999,999"
Received: "999999"

[Killed] EqualityOperator
lib.js:194:7
   if (num >= 1000) {
     return num.toFixed(0).replace(/\B(?=(\d{3})+(?!\d))/g, ",");
   }
-  if (num >= 1) {
+  if (num < 1) {
     return num.toFixed(4).replace(/\.?0+$/, "");
   }
killedBy: formatRatio boundary: exactly 1 uses 4-decimal format (>= not >)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1.0001"
Received: "1.00005"

[Killed] BlockStatement
lib.js:194:17
   if (num >= 1000) {
     return num.toFixed(0).replace(/\B(?=(\d{3})+(?!\d))/g, ",");
   }
-  if (num >= 1) {
-    return num.toFixed(4).replace(/\.?0+$/, "");
-  }
+  if (num >= 1) {}
   if (num >= 0.0001) {
     return num.toFixed(6).replace(/\.?0+$/, "");
killedBy: formatRatio boundary: exactly 1 uses 4-decimal format (>= not >)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1.0001"
Received: "1.00005"

[Killed] StringLiteral
lib.js:195:45
     return num.toFixed(0).replace(/\B(?=(\d{3})+(?!\d))/g, ",");
   }
   if (num >= 1) {
-    return num.toFixed(4).replace(/\.?0+$/, "");
+    return num.toFixed(4).replace(/\.?0+$/, "Stryker was here!");
   }
   if (num >= 0.0001) {
killedBy: formatRatio shows up to 4 significant decimals for values >= 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1.5"
Received: "1.5Stryker was here!"

[Killed] Regex
lib.js:195:35
     return num.toFixed(0).replace(/\B(?=(\d{3})+(?!\d))/g, ",");
   }
   if (num >= 1) {
-    return num.toFixed(4).replace(/\.?0+$/, "");
+    return num.toFixed(4).replace(/\.?0+/, "");
   }
   if (num >= 0.0001) {
killedBy: formatRatio boundary: exactly 1 uses 4-decimal format (>= not >)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1.0001"
Received: "11"

[Killed] EqualityOperator
lib.js:197:7
   if (num >= 1) {
     return num.toFixed(4).replace(/\.?0+$/, "");
   }
-  if (num >= 0.0001) {
+  if (num < 0.0001) {
     return num.toFixed(6).replace(/\.?0+$/, "");
   }
killedBy: formatRatio shows up to 6 decimals for values < 1 >= 0.0001
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0.123456"
Received: "1.23e-1"

[Killed] ConditionalExpression
lib.js:197:7
   if (num >= 1) {
     return num.toFixed(4).replace(/\.?0+$/, "");
   }
-  if (num >= 0.0001) {
+  if (false) {
     return num.toFixed(6).replace(/\.?0+$/, "");
   }
killedBy: formatRatio shows up to 6 decimals for values < 1 >= 0.0001
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0.123456"
Received: "1.23e-1"

[Killed] Regex
lib.js:198:35
     return num.toFixed(4).replace(/\.?0+$/, "");
   }
   if (num >= 0.0001) {
-    return num.toFixed(6).replace(/\.?0+$/, "");
+    return num.toFixed(6).replace(/\.0+$/, "");
   }
   return num.toExponential(2);
killedBy: formatRatio shows up to 6 decimals for values < 1 >= 0.0001
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0.0001"
Received: "0.000100"

[Killed] Regex
lib.js:198:35
     return num.toFixed(4).replace(/\.?0+$/, "");
   }
   if (num >= 0.0001) {
-    return num.toFixed(6).replace(/\.?0+$/, "");
+    return num.toFixed(6).replace(/\.?0+/, "");
   }
   return num.toExponential(2);
killedBy: formatRatio shows up to 6 decimals for values < 1 >= 0.0001
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0.123456"
Received: ".123456"

[Killed] BlockStatement
lib.js:209:37
  * @param {number} decimals - Token decimals
  * @returns {bigint|null} Amount in base units or null if invalid
  */
-function parseAmount(str, decimals) {
-  if (!str || typeof str !== "string") return null;
-
-  const cleaned = str.trim().replace(/,/g, "");
-  if (!/^\d*\.?\d*$/.test(cleaned) || cleaned === "" || cleaned === ".") {
-    return null;
-  }
-
-  const parts = cleaned.split(".");
-  const wholePart = parts[0] || "0";
-  let fracPart = parts[1] || "";
-
-  if (fracPart.length > decimals) {
-    fracPart = fracPart.slice(0, decimals);
-  }
-
-  fracPart = fracPart.padEnd(decimals, "0");
-
-  try {
-    return BigInt(wholePart + fracPart);
-  } catch (e) {
-    return null;
-  }
-}
+function parseAmount(str, decimals) {}
 
 // ============================================================================
killedBy: parseAmount multiplies by 10^decimals for whole numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1000000000000000000n
Received: undefined

[Killed] ConditionalExpression
lib.js:210:7
  * @returns {bigint|null} Amount in base units or null if invalid
  */
 function parseAmount(str, decimals) {
-  if (!str || typeof str !== "string") return null;
+  if (true) return null;
 
   const cleaned = str.trim().replace(/,/g, "");
killedBy: parseAmount multiplies by 10^decimals for whole numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1000000000000000000n
Received: null

[Killed] ConditionalExpression
lib.js:210:15
  * @returns {bigint|null} Amount in base units or null if invalid
  */
 function parseAmount(str, decimals) {
-  if (!str || typeof str !== "string") return null;
+  if (!str || false) return null;
 
   const cleaned = str.trim().replace(/,/g, "");
killedBy: parseAmount type validation rejects non-string input (!str and typeof check)
statusReason: TypeError: str.trim is not a function

[Killed] MethodExpression
lib.js:212:19
 function parseAmount(str, decimals) {
   if (!str || typeof str !== "string") return null;
 
-  const cleaned = str.trim().replace(/,/g, "");
+  const cleaned = str.replace(/,/g, "");
   if (!/^\d*\.?\d*$/.test(cleaned) || cleaned === "" || cleaned === ".") {
     return null;
killedBy: parseAmount trims whitespace from input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1500000n
Received: null

[Killed] StringLiteral
lib.js:212:44
 function parseAmount(str, decimals) {
   if (!str || typeof str !== "string") return null;
 
-  const cleaned = str.trim().replace(/,/g, "");
+  const cleaned = str.trim().replace(/,/g, "Stryker was here!");
   if (!/^\d*\.?\d*$/.test(cleaned) || cleaned === "" || cleaned === ".") {
     return null;
killedBy: parseAmount strips commas from input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1000000000n
Received: null

[Killed] BlockStatement
lib.js:213:74
   if (!str || typeof str !== "string") return null;
 
   const cleaned = str.trim().replace(/,/g, "");
-  if (!/^\d*\.?\d*$/.test(cleaned) || cleaned === "" || cleaned === ".") {
-    return null;
-  }
+  if (!/^\d*\.?\d*$/.test(cleaned) || cleaned === "" || cleaned === ".") {}
 
   const parts = cleaned.split(".");
killedBy: parseAmount returns null for invalid input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: 0n

[Killed] EqualityOperator
lib.js:213:39
   if (!str || typeof str !== "string") return null;
 
   const cleaned = str.trim().replace(/,/g, "");
-  if (!/^\d*\.?\d*$/.test(cleaned) || cleaned === "" || cleaned === ".") {
+  if (!/^\d*\.?\d*$/.test(cleaned) || cleaned !== "" || cleaned === ".") {
     return null;
   }
killedBy: parseAmount multiplies by 10^decimals for whole numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1000000000000000000n
Received: null

[Killed] LogicalOperator
lib.js:218:21
   }
 
   const parts = cleaned.split(".");
-  const wholePart = parts[0] || "0";
+  const wholePart = parts[0] && "0";
   let fracPart = parts[1] || "";
 
killedBy: parseAmount multiplies by 10^decimals for whole numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1000000000000000000n
Received: 0n

[Killed] ConditionalExpression
lib.js:218:21
   }
 
   const parts = cleaned.split(".");
-  const wholePart = parts[0] || "0";
+  const wholePart = true;
   let fracPart = parts[1] || "";
 
killedBy: parseAmount multiplies by 10^decimals for whole numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1000000000000000000n
Received: null

[Killed] ConditionalExpression
lib.js:219:18
 
   const parts = cleaned.split(".");
   const wholePart = parts[0] || "0";
-  let fracPart = parts[1] || "";
+  let fracPart = true;
 
   if (fracPart.length > decimals) {
killedBy: parseAmount multiplies by 10^decimals for whole numbers
statusReason: TypeError: fracPart.padEnd is not a function

[Killed] ConditionalExpression
lib.js:219:18
 
   const parts = cleaned.split(".");
   const wholePart = parts[0] || "0";
-  let fracPart = parts[1] || "";
+  let fracPart = false;
 
   if (fracPart.length > decimals) {
killedBy: parseAmount multiplies by 10^decimals for whole numbers
statusReason: TypeError: fracPart.padEnd is not a function

[Killed] BlockStatement
lib.js:221:35
   const wholePart = parts[0] || "0";
   let fracPart = parts[1] || "";
 
-  if (fracPart.length > decimals) {
-    fracPart = fracPart.slice(0, decimals);
-  }
+  if (fracPart.length > decimals) {}
 
   fracPart = fracPart.padEnd(decimals, "0");
killedBy: parseAmount truncates decimals exceeding token precision
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1123456n
Received: 11234567n

[Killed] EqualityOperator
lib.js:221:7
   const wholePart = parts[0] || "0";
   let fracPart = parts[1] || "";
 
-  if (fracPart.length > decimals) {
+  if (fracPart.length <= decimals) {
     fracPart = fracPart.slice(0, decimals);
   }
killedBy: parseAmount truncates decimals exceeding token precision
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1123456n
Received: 11234567n

[Killed] MethodExpression
lib.js:222:16
   let fracPart = parts[1] || "";
 
   if (fracPart.length > decimals) {
-    fracPart = fracPart.slice(0, decimals);
+    fracPart = fracPart;
   }
 
killedBy: parseAmount truncates decimals exceeding token precision
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1123456n
Received: 11234567n

[Killed] StringLiteral
lib.js:225:40
     fracPart = fracPart.slice(0, decimals);
   }
 
-  fracPart = fracPart.padEnd(decimals, "0");
+  fracPart = fracPart.padEnd(decimals, "");
 
   try {
killedBy: parseAmount multiplies by 10^decimals for whole numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1000000000000000000n
Received: 1n

[Killed] BlockStatement
lib.js:227:7
 
   fracPart = fracPart.padEnd(decimals, "0");
 
-  try {
-    return BigInt(wholePart + fracPart);
-  } catch (e) {
+  try {} catch (e) {
     return null;
   }
killedBy: parseAmount multiplies by 10^decimals for whole numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1000000000000000000n
Received: undefined

[Killed] ArithmeticOperator
lib.js:228:19
   fracPart = fracPart.padEnd(decimals, "0");
 
   try {
-    return BigInt(wholePart + fracPart);
+    return BigInt(wholePart - fracPart);
   } catch (e) {
     return null;
killedBy: parseAmount multiplies by 10^decimals for whole numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1000000000000000000n
Received: 1n

[NoCoverage] BlockStatement
lib.js:229:15
 
   try {
     return BigInt(wholePart + fracPart);
-  } catch (e) {
-    return null;
-  }
+  } catch (e) {}
 }
 

[Killed] BlockStatement
lib.js:245:52
  * @param {number} ttlMs - Cache TTL in milliseconds
  * @returns {{usd: number, fetchedAt: number}|null}
  */
-function getCachedPrice(coinGeckoId, cache, ttlMs) {
-  const cached = cache.get(coinGeckoId);
-  if (!cached) return null;
-  if (Date.now() - cached.fetchedAt > ttlMs) return null;
-  return cached;
-}
+function getCachedPrice(coinGeckoId, cache, ttlMs) {}
 
 /**
killedBy: getCachedPrice returns null for cache miss
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: undefined

[Killed] BooleanLiteral
lib.js:247:7
  */
 function getCachedPrice(coinGeckoId, cache, ttlMs) {
   const cached = cache.get(coinGeckoId);
-  if (!cached) return null;
+  if (cached) return null;
   if (Date.now() - cached.fetchedAt > ttlMs) return null;
   return cached;
killedBy: getCachedPrice returns null for cache miss
statusReason: TypeError: Cannot read properties of undefined (reading 'fetchedAt')

[Killed] ConditionalExpression
lib.js:247:7
  */
 function getCachedPrice(coinGeckoId, cache, ttlMs) {
   const cached = cache.get(coinGeckoId);
-  if (!cached) return null;
+  if (false) return null;
   if (Date.now() - cached.fetchedAt > ttlMs) return null;
   return cached;
killedBy: getCachedPrice returns null for cache miss
statusReason: TypeError: Cannot read properties of undefined (reading 'fetchedAt')

[Killed] ConditionalExpression
lib.js:248:7
 function getCachedPrice(coinGeckoId, cache, ttlMs) {
   const cached = cache.get(coinGeckoId);
   if (!cached) return null;
-  if (Date.now() - cached.fetchedAt > ttlMs) return null;
+  if (false) return null;
   return cached;
 }
killedBy: getCachedPrice returns null when entry exceeds TTL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: {"fetchedAt": 1767916592589, "usd": 3500}

[Killed] ConditionalExpression
lib.js:248:7
 function getCachedPrice(coinGeckoId, cache, ttlMs) {
   const cached = cache.get(coinGeckoId);
   if (!cached) return null;
-  if (Date.now() - cached.fetchedAt > ttlMs) return null;
+  if (true) return null;
   return cached;
 }
killedBy: getCachedPrice returns cached entry when within TTL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"fetchedAt": 1767916682577, "usd": 3500}
Received: null

[Killed] BlockStatement
lib.js:259:52
  * @param {number} ttlMs - Cache TTL in milliseconds
  * @returns {number|null} USD price or null if unavailable
  */
-function getTokenPrice(tokenAddress, cache, ttlMs) {
-  const id = COINGECKO_ID_MAP[tokenAddress.toLowerCase()];
-  if (!id) return null;
-  const cached = getCachedPrice(id, cache, ttlMs);
-  return cached ? cached.usd : null;
-}
+function getTokenPrice(tokenAddress, cache, ttlMs) {}
 
 /**
killedBy: getTokenPrice returns price for token in COINGECKO_ID_MAP
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3500
Received: undefined

[Killed] MethodExpression
lib.js:260:31
  * @returns {number|null} USD price or null if unavailable
  */
 function getTokenPrice(tokenAddress, cache, ttlMs) {
-  const id = COINGECKO_ID_MAP[tokenAddress.toLowerCase()];
+  const id = COINGECKO_ID_MAP[tokenAddress.toUpperCase()];
   if (!id) return null;
   const cached = getCachedPrice(id, cache, ttlMs);
killedBy: getTokenPrice returns price for token in COINGECKO_ID_MAP
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3500
Received: null

[Killed] BooleanLiteral
lib.js:261:7
  */
 function getTokenPrice(tokenAddress, cache, ttlMs) {
   const id = COINGECKO_ID_MAP[tokenAddress.toLowerCase()];
-  if (!id) return null;
+  if (id) return null;
   const cached = getCachedPrice(id, cache, ttlMs);
   return cached ? cached.usd : null;
killedBy: getTokenPrice returns price for token in COINGECKO_ID_MAP
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3500
Received: null

[Killed] ConditionalExpression
lib.js:261:7
  */
 function getTokenPrice(tokenAddress, cache, ttlMs) {
   const id = COINGECKO_ID_MAP[tokenAddress.toLowerCase()];
-  if (!id) return null;
+  if (true) return null;
   const cached = getCachedPrice(id, cache, ttlMs);
   return cached ? cached.usd : null;
killedBy: getTokenPrice returns price for token in COINGECKO_ID_MAP
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3500
Received: null

[Killed] EqualityOperator
lib.js:276:26
   const priceA = getPriceFn(order.tokenA.address);
   const priceB = getPriceFn(order.tokenB.address);
 
-  if (priceA === null || priceB === null) return null;
+  if (priceA === null || priceB !== null) return null;
   if (priceA === 0 || priceB === 0) return null;
 
killedBy: calculateMarketDeviation calculates positive deviation when asking more than market
statusReason: TypeError: Cannot read properties of null (reading 'deviation')

[Killed] LogicalOperator
lib.js:276:7
   const priceA = getPriceFn(order.tokenA.address);
   const priceB = getPriceFn(order.tokenB.address);
 
-  if (priceA === null || priceB === null) return null;
+  if (priceA === null && priceB === null) return null;
   if (priceA === 0 || priceB === 0) return null;
 
killedBy: calculateMarketDeviation returns null when price unavailable
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: {"deviation": Infinity, "label": "+Infinity%"}

[Killed] ConditionalExpression
lib.js:277:7
   const priceB = getPriceFn(order.tokenB.address);
 
   if (priceA === null || priceB === null) return null;
-  if (priceA === 0 || priceB === 0) return null;
+  if (true) return null;
 
   const amountA = BigInt(order.amountA);
killedBy: calculateMarketDeviation calculates positive deviation when asking more than market
statusReason: TypeError: Cannot read properties of null (reading 'deviation')

[Killed] ConditionalExpression
lib.js:277:7
   const priceB = getPriceFn(order.tokenB.address);
 
   if (priceA === null || priceB === null) return null;
-  if (priceA === 0 || priceB === 0) return null;
+  if (false) return null;
 
   const amountA = BigInt(order.amountA);
killedBy: calculateMarketDeviation returns null when priceA is zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: {"deviation": Infinity, "label": "+Infinity%"}

[Killed] ConditionalExpression
lib.js:282:7
   const amountA = BigInt(order.amountA);
   const amountB = BigInt(order.amountB);
 
-  if (amountA === 0n || amountB === 0n) return null;
+  if (false || amountB === 0n) return null;
 
   const marketRate = priceA / priceB;
killedBy: calculateMarketDeviation returns null when amount is zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: {"deviation": Infinity, "label": "+Infinity%"}

[Killed] ConditionalExpression
lib.js:282:7
   const amountA = BigInt(order.amountA);
   const amountB = BigInt(order.amountB);
 
-  if (amountA === 0n || amountB === 0n) return null;
+  if (false) return null;
 
   const marketRate = priceA / priceB;
killedBy: calculateMarketDeviation returns null when amount is zero
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: {"deviation": Infinity, "label": "+Infinity%"}

[Killed] ArithmeticOperator
lib.js:284:22
 
   if (amountA === 0n || amountB === 0n) return null;
 
-  const marketRate = priceA / priceB;
+  const marketRate = priceA * priceB;
   const humanAmountA = Number(amountA) / Math.pow(10, order.tokenA.decimals);
   const humanAmountB = Number(amountB) / Math.pow(10, order.tokenB.decimals);
killedBy: calculateMarketDeviation calculates positive deviation when asking more than market
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 25
Received: -99.95

Expected precision:    0
Expected difference: < 0.5
Received difference:   124.95

[Killed] ArithmeticOperator
lib.js:285:24
   if (amountA === 0n || amountB === 0n) return null;
 
   const marketRate = priceA / priceB;
-  const humanAmountA = Number(amountA) / Math.pow(10, order.tokenA.decimals);
+  const humanAmountA = Number(amountA) * Math.pow(10, order.tokenA.decimals);
   const humanAmountB = Number(amountB) / Math.pow(10, order.tokenB.decimals);
   const orderRate = humanAmountB / humanAmountA;
killedBy: calculateMarketDeviation calculates positive deviation when asking more than market
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 25
Received: -100

Expected precision:    0
Expected difference: < 0.5
Received difference:   125

[Killed] ArithmeticOperator
lib.js:286:24
 
   const marketRate = priceA / priceB;
   const humanAmountA = Number(amountA) / Math.pow(10, order.tokenA.decimals);
-  const humanAmountB = Number(amountB) / Math.pow(10, order.tokenB.decimals);
+  const humanAmountB = Number(amountB) * Math.pow(10, order.tokenB.decimals);
   const orderRate = humanAmountB / humanAmountA;
 
killedBy: calculateMarketDeviation calculates positive deviation when asking more than market
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 25
Received: 1.25e+38

Expected precision:    0
Expected difference: < 5e-1
Received difference:   1.25e+38

[Killed] ArithmeticOperator
lib.js:287:21
   const marketRate = priceA / priceB;
   const humanAmountA = Number(amountA) / Math.pow(10, order.tokenA.decimals);
   const humanAmountB = Number(amountB) / Math.pow(10, order.tokenB.decimals);
-  const orderRate = humanAmountB / humanAmountA;
+  const orderRate = humanAmountB * humanAmountA;
 
   const deviation = ((orderRate - marketRate) / marketRate) * 100;
killedBy: calculateMarketDeviation calculates order rate as amountB / amountA (division not multiplication)
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 1
Received:   300

[Killed] ArithmeticOperator
lib.js:289:23
   const humanAmountB = Number(amountB) / Math.pow(10, order.tokenB.decimals);
   const orderRate = humanAmountB / humanAmountA;
 
-  const deviation = ((orderRate - marketRate) / marketRate) * 100;
+  const deviation = ((orderRate + marketRate) / marketRate) * 100;
 
   let label;
killedBy: calculateMarketDeviation calculates positive deviation when asking more than market
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 25
Received: 225

Expected precision:    0
Expected difference: < 0.5
Received difference:   200

[Killed] ArithmeticOperator
lib.js:289:22
   const humanAmountB = Number(amountB) / Math.pow(10, order.tokenB.decimals);
   const orderRate = humanAmountB / humanAmountA;
 
-  const deviation = ((orderRate - marketRate) / marketRate) * 100;
+  const deviation = ((orderRate - marketRate) * marketRate) * 100;
 
   let label;
killedBy: calculateMarketDeviation calculates positive deviation when asking more than market
statusReason: Error: expect(received).toBeCloseTo(expected, precision)

Expected: 25
Received: 100

Expected precision:    0
Expected difference: < 0.5
Received difference:   75

[Killed] BlockStatement
lib.js:292:34
   const deviation = ((orderRate - marketRate) / marketRate) * 100;
 
   let label;
-  if (Math.abs(deviation) < 0.5) {
-    label = "~market";
-  } else if (deviation > 0) {
+  if (Math.abs(deviation) < 0.5) {} else if (deviation > 0) {
     label = "+" + deviation.toFixed(1) + "%";
   } else {
killedBy: calculateMarketDeviation shows ~market for deviation under 0.5%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "~market"
Received: undefined

[Killed] ConditionalExpression
lib.js:292:7
   const deviation = ((orderRate - marketRate) / marketRate) * 100;
 
   let label;
-  if (Math.abs(deviation) < 0.5) {
+  if (true) {
     label = "~market";
   } else if (deviation > 0) {
killedBy: calculateMarketDeviation calculates positive deviation when asking more than market
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "+25.0%"
Received: "~market"
