[Killed] StringLiteral
lib.js:293:13
 
   let label;
   if (Math.abs(deviation) < 0.5) {
-    label = "~market";
+    label = "";
   } else if (deviation > 0) {
     label = "+" + deviation.toFixed(1) + "%";
killedBy: calculateMarketDeviation shows ~market for deviation under 0.5%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "~market"
Received: ""

[Killed] BlockStatement
lib.js:294:29
   let label;
   if (Math.abs(deviation) < 0.5) {
     label = "~market";
-  } else if (deviation > 0) {
-    label = "+" + deviation.toFixed(1) + "%";
-  } else {
+  } else if (deviation > 0) {} else {
     label = deviation.toFixed(1) + "%";
   }
killedBy: calculateMarketDeviation calculates positive deviation when asking more than market
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "+25.0%"
Received: undefined

[Killed] ConditionalExpression
lib.js:294:14
   let label;
   if (Math.abs(deviation) < 0.5) {
     label = "~market";
-  } else if (deviation > 0) {
+  } else if (false) {
     label = "+" + deviation.toFixed(1) + "%";
   } else {
killedBy: calculateMarketDeviation calculates positive deviation when asking more than market
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "+25.0%"
Received: "25.0%"

[Killed] StringLiteral
lib.js:295:13
   if (Math.abs(deviation) < 0.5) {
     label = "~market";
   } else if (deviation > 0) {
-    label = "+" + deviation.toFixed(1) + "%";
+    label = "" + deviation.toFixed(1) + "%";
   } else {
     label = deviation.toFixed(1) + "%";
killedBy: calculateMarketDeviation calculates positive deviation when asking more than market
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "+25.0%"
Received: "25.0%"

[Killed] BlockStatement
lib.js:296:10
     label = "~market";
   } else if (deviation > 0) {
     label = "+" + deviation.toFixed(1) + "%";
-  } else {
-    label = deviation.toFixed(1) + "%";
-  }
+  } else {}
 
   return { deviation, label };
killedBy: calculateMarketDeviation calculates negative deviation for discount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "-25.0%"
Received: undefined

[Killed] ConditionalExpression
lib.js:315:7
  * @returns {Array} Matching tokens
  */
 function searchTokens(query, tokenList, limit = 10) {
-  if (!query || query.length < 1) return [];
+  if (true) return [];
 
   const q = query.toLowerCase();
killedBy: searchTokens exact symbol match appears first
statusReason: TypeError: Cannot read properties of undefined (reading 'symbol')

[Killed] LogicalOperator
lib.js:315:7
  * @returns {Array} Matching tokens
  */
 function searchTokens(query, tokenList, limit = 10) {
-  if (!query || query.length < 1) return [];
+  if (!query && query.length < 1) return [];
 
   const q = query.toLowerCase();
killedBy: searchTokens returns empty array for empty query
statusReason: TypeError: Cannot read properties of null (reading 'length')

[Killed] MethodExpression
lib.js:317:13
 function searchTokens(query, tokenList, limit = 10) {
   if (!query || query.length < 1) return [];
 
-  const q = query.toLowerCase();
+  const q = query.toUpperCase();
   const results = [];
 
killedBy: searchTokens exact symbol match appears first
statusReason: TypeError: Cannot read properties of undefined (reading 'symbol')

[Killed] BlockStatement
lib.js:321:30
   const results = [];
 
   // Exact symbol matches first
-  for (const t of tokenList) {
-    if (t.symbol.toLowerCase() === q) {
-      results.push(t);
-    }
-  }
+  for (const t of tokenList) {}
 
   // Symbol starts with query
killedBy: searchTokens exact match prioritized over startsWith match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "WETH"
Received: "WETHX"

[Killed] ConditionalExpression
lib.js:322:9
 
   // Exact symbol matches first
   for (const t of tokenList) {
-    if (t.symbol.toLowerCase() === q) {
+    if (true) {
       results.push(t);
     }
killedBy: searchTokens respects limit parameter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 5

[Killed] BlockStatement
lib.js:322:39
 
   // Exact symbol matches first
   for (const t of tokenList) {
-    if (t.symbol.toLowerCase() === q) {
-      results.push(t);
-    }
+    if (t.symbol.toLowerCase() === q) {}
   }
 
killedBy: searchTokens exact match prioritized over startsWith match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "WETH"
Received: "WETHX"

[Killed] BlockStatement
lib.js:328:30
   }
 
   // Symbol starts with query
-  for (const t of tokenList) {
-    if (t.symbol.toLowerCase().startsWith(q) && !results.includes(t)) {
-      results.push(t);
-      if (results.length >= limit) return results;
-    }
-  }
+  for (const t of tokenList) {}
 
   // Symbol or name contains query
killedBy: searchTokens second loop uses startsWith not endsWith
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "INGEST"
Received: "ENDING"

[Killed] ConditionalExpression
lib.js:329:9
 
   // Symbol starts with query
   for (const t of tokenList) {
-    if (t.symbol.toLowerCase().startsWith(q) && !results.includes(t)) {
+    if (true) {
       results.push(t);
       if (results.length >= limit) return results;
killedBy: searchTokens searches by name as well as symbol
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LINK"
Received: "WETH"

[Killed] ConditionalExpression
lib.js:329:9
 
   // Symbol starts with query
   for (const t of tokenList) {
-    if (t.symbol.toLowerCase().startsWith(q) && !results.includes(t)) {
+    if (false) {
       results.push(t);
       if (results.length >= limit) return results;
killedBy: searchTokens second loop uses startsWith not endsWith
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "INGEST"
Received: "ENDING"

[Killed] ConditionalExpression
lib.js:331:11
   for (const t of tokenList) {
     if (t.symbol.toLowerCase().startsWith(q) && !results.includes(t)) {
       results.push(t);
-      if (results.length >= limit) return results;
+      if (false) return results;
     }
   }
killedBy: searchTokens boundary: returns exactly limit results (>= not >)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 4

[Killed] EqualityOperator
lib.js:331:11
   for (const t of tokenList) {
     if (t.symbol.toLowerCase().startsWith(q) && !results.includes(t)) {
       results.push(t);
-      if (results.length >= limit) return results;
+      if (results.length > limit) return results;
     }
   }
killedBy: searchTokens boundary: returns exactly limit results (>= not >)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 4

[Killed] BlockStatement
lib.js:336:30
   }
 
   // Symbol or name contains query
-  for (const t of tokenList) {
-    if ((t.symbol.toLowerCase().includes(q) || t.name.toLowerCase().includes(q)) && !results.includes(t)) {
-      results.push(t);
-      if (results.length >= limit) return results;
-    }
-  }
+  for (const t of tokenList) {}
 
   return results;
killedBy: searchTokens searches by name as well as symbol
statusReason: TypeError: Cannot read properties of undefined (reading 'symbol')

[Killed] LogicalOperator
lib.js:337:9
 
   // Symbol or name contains query
   for (const t of tokenList) {
-    if ((t.symbol.toLowerCase().includes(q) || t.name.toLowerCase().includes(q)) && !results.includes(t)) {
+    if (t.symbol.toLowerCase().includes(q) || t.name.toLowerCase().includes(q) || !results.includes(t)) {
       results.push(t);
       if (results.length >= limit) return results;
killedBy: searchTokens searches by name as well as symbol
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LINK"
Received: "WETH"

[Killed] BooleanLiteral
lib.js:337:85
 
   // Symbol or name contains query
   for (const t of tokenList) {
-    if ((t.symbol.toLowerCase().includes(q) || t.name.toLowerCase().includes(q)) && !results.includes(t)) {
+    if ((t.symbol.toLowerCase().includes(q) || t.name.toLowerCase().includes(q)) && results.includes(t)) {
       results.push(t);
       if (results.length >= limit) return results;
killedBy: searchTokens searches by name as well as symbol
statusReason: TypeError: Cannot read properties of undefined (reading 'symbol')

[Killed] EqualityOperator
lib.js:339:11
   for (const t of tokenList) {
     if ((t.symbol.toLowerCase().includes(q) || t.name.toLowerCase().includes(q)) && !results.includes(t)) {
       results.push(t);
-      if (results.length >= limit) return results;
+      if (results.length < limit) return results;
     }
   }
killedBy: searchTokens includes loop respects limit boundary (>= not >)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BlockStatement
lib.js:361:35
  * @param {Storage} storage - Storage object
  * @returns {Array<{address: string, symbol: string}>}
  */
-function getRecentTokens(storage) {
-  try {
-    const stored = storage.getItem(RECENT_TOKENS_KEY);
-    return stored ? JSON.parse(stored) : [];
-  } catch (e) {
-    return [];
-  }
-}
+function getRecentTokens(storage) {}
 
 /**
killedBy: getRecentTokens / addRecentToken getRecentTokens returns [] for missing key
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] BlockStatement
lib.js:362:7
  * @returns {Array<{address: string, symbol: string}>}
  */
 function getRecentTokens(storage) {
-  try {
-    const stored = storage.getItem(RECENT_TOKENS_KEY);
-    return stored ? JSON.parse(stored) : [];
-  } catch (e) {
+  try {} catch (e) {
     return [];
   }
killedBy: getRecentTokens / addRecentToken getRecentTokens returns [] for missing key
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] ArrayDeclaration
lib.js:364:42
 function getRecentTokens(storage) {
   try {
     const stored = storage.getItem(RECENT_TOKENS_KEY);
-    return stored ? JSON.parse(stored) : [];
+    return stored ? JSON.parse(stored) : ["Stryker was here"];
   } catch (e) {
     return [];
killedBy: getRecentTokens / addRecentToken getRecentTokens returns [] for missing key
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] BlockStatement
lib.js:365:15
   try {
     const stored = storage.getItem(RECENT_TOKENS_KEY);
     return stored ? JSON.parse(stored) : [];
-  } catch (e) {
-    return [];
-  }
+  } catch (e) {}
 }
 
killedBy: getRecentTokens / addRecentToken getRecentTokens returns [] on JSON parse error
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] BlockStatement
lib.js:376:51
  * @param {string} symbol - Token symbol
  * @param {Storage} storage - Storage object
  */
-function addRecentToken(address, symbol, storage) {
-  if (!address || !symbol) return;
-
-  const recent = getRecentTokens(storage);
-  const lowerAddr = address.toLowerCase();
-
-  const filtered = recent.filter(t => t.address.toLowerCase() !== lowerAddr);
-  filtered.unshift({ address, symbol });
-  const trimmed = filtered.slice(0, MAX_RECENT_TOKENS);
-
-  try {
-    storage.setItem(RECENT_TOKENS_KEY, JSON.stringify(trimmed));
-  } catch (e) {
-    // Storage unavailable
-  }
-}
+function addRecentToken(address, symbol, storage) {}
 
 /**
killedBy: getRecentTokens / addRecentToken addRecentToken adds to front of list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "NEW"
Received: "OLD"

[Killed] LogicalOperator
lib.js:377:7
  * @param {Storage} storage - Storage object
  */
 function addRecentToken(address, symbol, storage) {
-  if (!address || !symbol) return;
+  if (!address && !symbol) return;
 
   const recent = getRecentTokens(storage);
killedBy: getRecentTokens / addRecentToken addRecentToken rejects empty address
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 6

- Array []
+ Array [
+   Object {

[Killed] ConditionalExpression
lib.js:377:7
  * @param {Storage} storage - Storage object
  */
 function addRecentToken(address, symbol, storage) {
-  if (!address || !symbol) return;
+  if (true) return;
 
   const recent = getRecentTokens(storage);
killedBy: getRecentTokens / addRecentToken addRecentToken adds to front of list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "NEW"
Received: "OLD"

[Killed] MethodExpression
lib.js:380:21
   if (!address || !symbol) return;
 
   const recent = getRecentTokens(storage);
-  const lowerAddr = address.toLowerCase();
+  const lowerAddr = address.toUpperCase();
 
   const filtered = recent.filter(t => t.address.toLowerCase() !== lowerAddr);
killedBy: getRecentTokens / addRecentToken addRecentToken removes existing entry before adding
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] MethodExpression
lib.js:382:39
   const recent = getRecentTokens(storage);
   const lowerAddr = address.toLowerCase();
 
-  const filtered = recent.filter(t => t.address.toLowerCase() !== lowerAddr);
+  const filtered = recent.filter(t => t.address.toUpperCase() !== lowerAddr);
   filtered.unshift({ address, symbol });
   const trimmed = filtered.slice(0, MAX_RECENT_TOKENS);
killedBy: getRecentTokens / addRecentToken addRecentToken removes existing entry before adding
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] EqualityOperator
lib.js:382:39
   const recent = getRecentTokens(storage);
   const lowerAddr = address.toLowerCase();
 
-  const filtered = recent.filter(t => t.address.toLowerCase() !== lowerAddr);
+  const filtered = recent.filter(t => t.address.toLowerCase() === lowerAddr);
   filtered.unshift({ address, symbol });
   const trimmed = filtered.slice(0, MAX_RECENT_TOKENS);
killedBy: getRecentTokens / addRecentToken addRecentToken removes existing entry before adding
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] MethodExpression
lib.js:384:19
 
   const filtered = recent.filter(t => t.address.toLowerCase() !== lowerAddr);
   filtered.unshift({ address, symbol });
-  const trimmed = filtered.slice(0, MAX_RECENT_TOKENS);
+  const trimmed = filtered;
 
   try {
killedBy: getRecentTokens / addRecentToken addRecentToken limits to MAX_RECENT_TOKENS
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 11

[Killed] BlockStatement
lib.js:386:7
   filtered.unshift({ address, symbol });
   const trimmed = filtered.slice(0, MAX_RECENT_TOKENS);
 
-  try {
-    storage.setItem(RECENT_TOKENS_KEY, JSON.stringify(trimmed));
-  } catch (e) {
+  try {} catch (e) {
     // Storage unavailable
   }
killedBy: getRecentTokens / addRecentToken addRecentToken adds to front of list
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "NEW"
Received: "OLD"

[Killed] BlockStatement
lib.js:398:36
  * @param {Storage} storage - Storage object
  * @returns {Object}
  */
-function getWatchedOrders(storage) {
-  try {
-    const stored = storage.getItem(WATCHED_ORDERS_KEY);
-    return stored ? JSON.parse(stored) : {};
-  } catch (e) {
-    return {};
-  }
-}
+function getWatchedOrders(storage) {}
 
 /**
killedBy: watchOrder / unwatchOrder / isOrderWatched watchOrder stores correct status based on order state
statusReason: TypeError: Cannot set properties of undefined (setting '1')

[Killed] BlockStatement
lib.js:399:7
  * @returns {Object}
  */
 function getWatchedOrders(storage) {
-  try {
-    const stored = storage.getItem(WATCHED_ORDERS_KEY);
-    return stored ? JSON.parse(stored) : {};
-  } catch (e) {
+  try {} catch (e) {
     return {};
   }
killedBy: watchOrder / unwatchOrder / isOrderWatched watchOrder stores correct status based on order state
statusReason: TypeError: Cannot set properties of undefined (setting '1')

[Killed] BlockStatement
lib.js:402:15
   try {
     const stored = storage.getItem(WATCHED_ORDERS_KEY);
     return stored ? JSON.parse(stored) : {};
-  } catch (e) {
-    return {};
-  }
+  } catch (e) {}
 }
 
killedBy: watchOrder / unwatchOrder / isOrderWatched getWatchedOrders returns empty object on parse error
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {}
Received: undefined

[Killed] BlockStatement
lib.js:412:37
  * @param {Object} order - Order object
  * @param {Storage} storage - Storage object
  */
-function watchOrder(order, storage) {
-  const watched = getWatchedOrders(storage);
-  const status = order.active ? "Open" : (order.taker ? "Filled" : "Cancelled");
-  watched[order.orderId] = {
-    status: status,
-    symbol: order.tokenA.symbol + "/" + order.tokenB.symbol
-  };
-  try {
-    storage.setItem(WATCHED_ORDERS_KEY, JSON.stringify(watched));
-  } catch (e) {
-    // Storage unavailable
-  }
-}
+function watchOrder(order, storage) {}
 
 /**
killedBy: watchOrder / unwatchOrder / isOrderWatched watchOrder stores correct status based on order state
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] StringLiteral
lib.js:414:68
  */
 function watchOrder(order, storage) {
   const watched = getWatchedOrders(storage);
-  const status = order.active ? "Open" : (order.taker ? "Filled" : "Cancelled");
+  const status = order.active ? "Open" : (order.taker ? "Filled" : "");
   watched[order.orderId] = {
     status: status,
killedBy: watchOrder / unwatchOrder / isOrderWatched watchOrder stores correct status based on order state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Cancelled"
Received: ""

[Killed] StringLiteral
lib.js:414:33
  */
 function watchOrder(order, storage) {
   const watched = getWatchedOrders(storage);
-  const status = order.active ? "Open" : (order.taker ? "Filled" : "Cancelled");
+  const status = order.active ? "" : (order.taker ? "Filled" : "Cancelled");
   watched[order.orderId] = {
     status: status,
killedBy: watchOrder / unwatchOrder / isOrderWatched watchOrder stores correct status based on order state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Open"
Received: ""

[Killed] BlockStatement
lib.js:419:7
     status: status,
     symbol: order.tokenA.symbol + "/" + order.tokenB.symbol
   };
-  try {
-    storage.setItem(WATCHED_ORDERS_KEY, JSON.stringify(watched));
-  } catch (e) {
+  try {} catch (e) {
     // Storage unavailable
   }
killedBy: watchOrder / unwatchOrder / isOrderWatched watchOrder stores correct status based on order state
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
lib.js:431:41
  * @param {string} orderId - Order ID
  * @param {Storage} storage - Storage object
  */
-function unwatchOrder(orderId, storage) {
-  const watched = getWatchedOrders(storage);
-  delete watched[orderId];
-  try {
-    storage.setItem(WATCHED_ORDERS_KEY, JSON.stringify(watched));
-  } catch (e) {
-    // Storage unavailable
-  }
-}
+function unwatchOrder(orderId, storage) {}
 
 /**
killedBy: watchOrder / unwatchOrder / isOrderWatched unwatchOrder removes only specified order
statusReason: Error: expect(received).toBeUndefined()

Received: {"status": "Open", "symbol": "A/B"}

[Killed] BlockStatement
lib.js:434:7
 function unwatchOrder(orderId, storage) {
   const watched = getWatchedOrders(storage);
   delete watched[orderId];
-  try {
-    storage.setItem(WATCHED_ORDERS_KEY, JSON.stringify(watched));
-  } catch (e) {
+  try {} catch (e) {
     // Storage unavailable
   }
killedBy: watchOrder / unwatchOrder / isOrderWatched unwatchOrder removes only specified order
statusReason: Error: expect(received).toBeUndefined()

Received: {"status": "Open", "symbol": "A/B"}

[Killed] BlockStatement
lib.js:447:43
  * @param {Storage} storage - Storage object
  * @returns {boolean}
  */
-function isOrderWatched(orderId, storage) {
-  const watched = getWatchedOrders(storage);
-  return orderId in watched;
-}
+function isOrderWatched(orderId, storage) {}
 
 /**
killedBy: watchOrder / unwatchOrder / isOrderWatched isOrderWatched returns boolean
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
lib.js:457:50
  * @param {Object} filters - Filter object
  * @param {Storage} storage - Storage object
  */
-function saveFilterPreferences(filters, storage) {
-  try {
-    storage.setItem(FILTERS_KEY, JSON.stringify(filters));
-  } catch (e) {
-    // Storage unavailable
-  }
-}
+function saveFilterPreferences(filters, storage) {}
 
 /**
killedBy: filter/sort preferences saveFilterPreferences stores valid JSON
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"selling": "0x123", "status": "filled"}
Received: null

[Killed] BlockStatement
lib.js:458:7
  * @param {Storage} storage - Storage object
  */
 function saveFilterPreferences(filters, storage) {
-  try {
-    storage.setItem(FILTERS_KEY, JSON.stringify(filters));
-  } catch (e) {
+  try {} catch (e) {
     // Storage unavailable
   }
killedBy: filter/sort preferences saveFilterPreferences stores valid JSON
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"selling": "0x123", "status": "filled"}
Received: null

[Killed] BlockStatement
lib.js:470:41
  * @param {Storage} storage - Storage object
  * @returns {Object|null}
  */
-function loadFilterPreferences(storage) {
-  try {
-    const stored = storage.getItem(FILTERS_KEY);
-    return stored ? JSON.parse(stored) : null;
-  } catch (e) {
-    return null;
-  }
-}
+function loadFilterPreferences(storage) {}
 
 /**
killedBy: filter/sort preferences loadFilterPreferences returns null for missing key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: undefined

[Killed] BlockStatement
lib.js:471:7
  * @returns {Object|null}
  */
 function loadFilterPreferences(storage) {
-  try {
-    const stored = storage.getItem(FILTERS_KEY);
-    return stored ? JSON.parse(stored) : null;
-  } catch (e) {
+  try {} catch (e) {
     return null;
   }
killedBy: filter/sort preferences loadFilterPreferences returns null for missing key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: undefined

[Killed] BlockStatement
lib.js:474:15
   try {
     const stored = storage.getItem(FILTERS_KEY);
     return stored ? JSON.parse(stored) : null;
-  } catch (e) {
-    return null;
-  }
+  } catch (e) {}
 }
 
killedBy: filter/sort preferences loadFilterPreferences returns null on parse error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: undefined

[Killed] BlockStatement
lib.js:484:45
  * @param {Object} sort - Sort object
  * @param {Storage} storage - Storage object
  */
-function saveSortPreferences(sort, storage) {
-  try {
-    storage.setItem(SORT_KEY, JSON.stringify(sort));
-  } catch (e) {
-    // Storage unavailable
-  }
-}
+function saveSortPreferences(sort, storage) {}
 
 /**
killedBy: filter/sort preferences saveSortPreferences and loadSortPreferences use same key
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"column": "amountA", "direction": "asc"}
Received: null

[Killed] BlockStatement
lib.js:485:7
  * @param {Storage} storage - Storage object
  */
 function saveSortPreferences(sort, storage) {
-  try {
-    storage.setItem(SORT_KEY, JSON.stringify(sort));
-  } catch (e) {
+  try {} catch (e) {
     // Storage unavailable
   }
killedBy: filter/sort preferences saveSortPreferences and loadSortPreferences use same key
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"column": "amountA", "direction": "asc"}
Received: null

[Killed] BlockStatement
lib.js:497:39
  * @param {Storage} storage - Storage object
  * @returns {Object|null}
  */
-function loadSortPreferences(storage) {
-  try {
-    const stored = storage.getItem(SORT_KEY);
-    return stored ? JSON.parse(stored) : null;
-  } catch (e) {
-    return null;
-  }
-}
+function loadSortPreferences(storage) {}
 
 // ============================================================================
killedBy: filter/sort preferences saveSortPreferences and loadSortPreferences use same key
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"column": "amountA", "direction": "asc"}
Received: undefined

[Killed] BlockStatement
lib.js:498:7
  * @returns {Object|null}
  */
 function loadSortPreferences(storage) {
-  try {
-    const stored = storage.getItem(SORT_KEY);
-    return stored ? JSON.parse(stored) : null;
-  } catch (e) {
+  try {} catch (e) {
     return null;
   }
killedBy: filter/sort preferences saveSortPreferences and loadSortPreferences use same key
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"column": "amountA", "direction": "asc"}
Received: undefined

[Killed] ConditionalExpression
lib.js:524:7
     let aVal, bVal;
 
     switch (column) {
-      case "orderId":
-        aVal = parseInt(a.orderId);
-        bVal = parseInt(b.orderId);
-        break;
+      case "orderId":
       case "maker":
         aVal = a.maker.toLowerCase();
killedBy: sortOrders sorts orderId numerically
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   "10",
    "1",

[Killed] ConditionalExpression
lib.js:528:7
         aVal = parseInt(a.orderId);
         bVal = parseInt(b.orderId);
         break;
-      case "maker":
-        aVal = a.maker.toLowerCase();
-        bVal = b.maker.toLowerCase();
-        break;
+      case "maker":
       case "tokenA":
         aVal = (a.tokenA.symbol || "").toLowerCase();
killedBy: sortOrders sorts maker case-insensitively
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0xaaa"
Received: "0xccc"

[Killed] MethodExpression
lib.js:529:16
         bVal = parseInt(b.orderId);
         break;
       case "maker":
-        aVal = a.maker.toLowerCase();
+        aVal = a.maker.toUpperCase();
         bVal = b.maker.toLowerCase();
         break;
killedBy: sortOrders sorts maker case-insensitively
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0xaaa"
Received: "0xccc"

[Killed] MethodExpression
lib.js:530:16
         break;
       case "maker":
         aVal = a.maker.toLowerCase();
-        bVal = b.maker.toLowerCase();
+        bVal = b.maker.toUpperCase();
         break;
       case "tokenA":
killedBy: sortOrders sorts maker case-insensitively
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0xaaa"
Received: "0xbbb"

[Killed] ConditionalExpression
lib.js:532:7
         aVal = a.maker.toLowerCase();
         bVal = b.maker.toLowerCase();
         break;
-      case "tokenA":
-        aVal = (a.tokenA.symbol || "").toLowerCase();
-        bVal = (b.tokenA.symbol || "").toLowerCase();
-        break;
+      case "tokenA":
       case "amountA":
         aVal = BigInt(a.amountA);
killedBy: sortOrders sorts tokenA by symbol case-insensitively
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "DAI"
Received: "USDC"

[Killed] ConditionalExpression
lib.js:533:17
         bVal = b.maker.toLowerCase();
         break;
       case "tokenA":
-        aVal = (a.tokenA.symbol || "").toLowerCase();
+        aVal = (false).toLowerCase();
         bVal = (b.tokenA.symbol || "").toLowerCase();
         break;
killedBy: sortOrders sorts tokenA by symbol case-insensitively
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).toLowerCase is not a function

[Killed] LogicalOperator
lib.js:533:17
         bVal = b.maker.toLowerCase();
         break;
       case "tokenA":
-        aVal = (a.tokenA.symbol || "").toLowerCase();
+        aVal = (a.tokenA.symbol && "").toLowerCase();
         bVal = (b.tokenA.symbol || "").toLowerCase();
         break;
killedBy: sortOrders sorts tokenA by symbol case-insensitively
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "USDC"
Received: "WETH"

[Killed] MethodExpression
lib.js:534:16
         break;
       case "tokenA":
         aVal = (a.tokenA.symbol || "").toLowerCase();
-        bVal = (b.tokenA.symbol || "").toLowerCase();
+        bVal = (b.tokenA.symbol || "").toUpperCase();
         break;
       case "amountA":
killedBy: sortOrders sorts tokenA by symbol case-insensitively
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "DAI"
Received: "USDC"

[Killed] ConditionalExpression
lib.js:534:17
         break;
       case "tokenA":
         aVal = (a.tokenA.symbol || "").toLowerCase();
-        bVal = (b.tokenA.symbol || "").toLowerCase();
+        bVal = (true).toLowerCase();
         break;
       case "amountA":
killedBy: sortOrders sorts tokenA by symbol case-insensitively
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).toLowerCase is not a function
