[Killed] ConditionalExpression
lib.js:536:7
         aVal = (a.tokenA.symbol || "").toLowerCase();
         bVal = (b.tokenA.symbol || "").toLowerCase();
         break;
-      case "amountA":
-        aVal = BigInt(a.amountA);
-        bVal = BigInt(b.amountA);
-        if (aVal < bVal) return direction === "asc" ? -1 : 1;
-        if (aVal > bVal) return direction === "asc" ? 1 : -1;
-        return 0;
+      case "amountA":
       case "tokenB":
         aVal = (a.tokenB.symbol || "").toLowerCase();
killedBy: sortOrders sorts amountA as BigInt (handles large values)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: "1"

[Killed] StringLiteral
lib.js:536:12
         aVal = (a.tokenA.symbol || "").toLowerCase();
         bVal = (b.tokenA.symbol || "").toLowerCase();
         break;
-      case "amountA":
+      case "":
         aVal = BigInt(a.amountA);
         bVal = BigInt(b.amountA);
killedBy: sortOrders sorts amountA as BigInt (handles large values)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: "1"

[Killed] ConditionalExpression
lib.js:539:33
       case "amountA":
         aVal = BigInt(a.amountA);
         bVal = BigInt(b.amountA);
-        if (aVal < bVal) return direction === "asc" ? -1 : 1;
+        if (aVal < bVal) return false ? -1 : 1;
         if (aVal > bVal) return direction === "asc" ? 1 : -1;
         return 0;
killedBy: sortOrders sorts amountA as BigInt (handles large values)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: "1"

[Killed] EqualityOperator
lib.js:539:13
       case "amountA":
         aVal = BigInt(a.amountA);
         bVal = BigInt(b.amountA);
-        if (aVal < bVal) return direction === "asc" ? -1 : 1;
+        if (aVal >= bVal) return direction === "asc" ? -1 : 1;
         if (aVal > bVal) return direction === "asc" ? 1 : -1;
         return 0;
killedBy: sortOrders sorts amountA as BigInt (handles large values)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: "1"

[Killed] EqualityOperator
lib.js:540:13
         aVal = BigInt(a.amountA);
         bVal = BigInt(b.amountA);
         if (aVal < bVal) return direction === "asc" ? -1 : 1;
-        if (aVal > bVal) return direction === "asc" ? 1 : -1;
+        if (aVal >= bVal) return direction === "asc" ? 1 : -1;
         return 0;
       case "tokenB":
killedBy: sortOrders amountA boundary desc: equal values return 0 (> not >=)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: "2"

[Killed] EqualityOperator
lib.js:540:33
         aVal = BigInt(a.amountA);
         bVal = BigInt(b.amountA);
         if (aVal < bVal) return direction === "asc" ? -1 : 1;
-        if (aVal > bVal) return direction === "asc" ? 1 : -1;
+        if (aVal > bVal) return direction !== "asc" ? 1 : -1;
         return 0;
       case "tokenB":
killedBy: sortOrders sorts amountA descending correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: "1"

[Killed] ConditionalExpression
lib.js:542:7
         if (aVal < bVal) return direction === "asc" ? -1 : 1;
         if (aVal > bVal) return direction === "asc" ? 1 : -1;
         return 0;
-      case "tokenB":
-        aVal = (a.tokenB.symbol || "").toLowerCase();
-        bVal = (b.tokenB.symbol || "").toLowerCase();
-        break;
+      case "tokenB":
       case "amountB":
         aVal = BigInt(a.amountB);
killedBy: sortOrders sorts tokenB by symbol case-insensitively
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "USDC"
Received: "USDT"

[Killed] ConditionalExpression
lib.js:543:17
         if (aVal > bVal) return direction === "asc" ? 1 : -1;
         return 0;
       case "tokenB":
-        aVal = (a.tokenB.symbol || "").toLowerCase();
+        aVal = (false).toLowerCase();
         bVal = (b.tokenB.symbol || "").toLowerCase();
         break;
killedBy: sortOrders sorts tokenB by symbol case-insensitively
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).toLowerCase is not a function

[Killed] MethodExpression
lib.js:543:16
         if (aVal > bVal) return direction === "asc" ? 1 : -1;
         return 0;
       case "tokenB":
-        aVal = (a.tokenB.symbol || "").toLowerCase();
+        aVal = (a.tokenB.symbol || "").toUpperCase();
         bVal = (b.tokenB.symbol || "").toLowerCase();
         break;
killedBy: sortOrders sorts tokenB by symbol case-insensitively
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "USDC"
Received: "USDT"

[Killed] MethodExpression
lib.js:544:16
         return 0;
       case "tokenB":
         aVal = (a.tokenB.symbol || "").toLowerCase();
-        bVal = (b.tokenB.symbol || "").toLowerCase();
+        bVal = (b.tokenB.symbol || "").toUpperCase();
         break;
       case "amountB":
killedBy: sortOrders sorts tokenB by symbol case-insensitively
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "USDC"
Received: "WETH"

[Killed] LogicalOperator
lib.js:544:17
         return 0;
       case "tokenB":
         aVal = (a.tokenB.symbol || "").toLowerCase();
-        bVal = (b.tokenB.symbol || "").toLowerCase();
+        bVal = (b.tokenB.symbol && "").toLowerCase();
         break;
       case "amountB":
killedBy: sortOrders sorts tokenB by symbol case-insensitively
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "USDC"
Received: "WETH"

[Killed] ConditionalExpression
lib.js:546:7
         aVal = (a.tokenB.symbol || "").toLowerCase();
         bVal = (b.tokenB.symbol || "").toLowerCase();
         break;
-      case "amountB":
-        aVal = BigInt(a.amountB);
-        bVal = BigInt(b.amountB);
-        if (aVal < bVal) return direction === "asc" ? -1 : 1;
-        if (aVal > bVal) return direction === "asc" ? 1 : -1;
-        return 0;
+      case "amountB":
       case "usdVal":
         aVal = a._usdValue || 0;
killedBy: sortOrders sorts amountB as BigInt (handles large values)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: "1"

[Killed] StringLiteral
lib.js:546:12
         aVal = (a.tokenB.symbol || "").toLowerCase();
         bVal = (b.tokenB.symbol || "").toLowerCase();
         break;
-      case "amountB":
+      case "":
         aVal = BigInt(a.amountB);
         bVal = BigInt(b.amountB);
killedBy: sortOrders sorts amountB as BigInt (handles large values)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: "1"

[Killed] EqualityOperator
lib.js:549:13
       case "amountB":
         aVal = BigInt(a.amountB);
         bVal = BigInt(b.amountB);
-        if (aVal < bVal) return direction === "asc" ? -1 : 1;
+        if (aVal >= bVal) return direction === "asc" ? -1 : 1;
         if (aVal > bVal) return direction === "asc" ? 1 : -1;
         return 0;
killedBy: sortOrders sorts amountB as BigInt (handles large values)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: "1"

[Killed] EqualityOperator
lib.js:549:33
       case "amountB":
         aVal = BigInt(a.amountB);
         bVal = BigInt(b.amountB);
-        if (aVal < bVal) return direction === "asc" ? -1 : 1;
+        if (aVal < bVal) return direction !== "asc" ? -1 : 1;
         if (aVal > bVal) return direction === "asc" ? 1 : -1;
         return 0;
killedBy: sortOrders sorts amountB as BigInt (handles large values)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: "1"

[Killed] ConditionalExpression
lib.js:550:13
         aVal = BigInt(a.amountB);
         bVal = BigInt(b.amountB);
         if (aVal < bVal) return direction === "asc" ? -1 : 1;
-        if (aVal > bVal) return direction === "asc" ? 1 : -1;
+        if (false) return direction === "asc" ? 1 : -1;
         return 0;
       case "usdVal":
killedBy: sortOrders sorts amountB descending correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: "1"

[Killed] ConditionalExpression
lib.js:552:7
         if (aVal < bVal) return direction === "asc" ? -1 : 1;
         if (aVal > bVal) return direction === "asc" ? 1 : -1;
         return 0;
-      case "usdVal":
-        aVal = a._usdValue || 0;
-        bVal = b._usdValue || 0;
-        break;
+      case "usdVal":
       case "price":
         aVal = a._price || 0;
killedBy: sortOrders sorts usdVal numerically
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3500
Received: 5000

[Killed] ConditionalExpression
lib.js:553:16
         if (aVal > bVal) return direction === "asc" ? 1 : -1;
         return 0;
       case "usdVal":
-        aVal = a._usdValue || 0;
+        aVal = true;
         bVal = b._usdValue || 0;
         break;
killedBy: sortOrders sorts usdVal numerically
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2000
Received: 5000

[Killed] ConditionalExpression
lib.js:553:16
         if (aVal > bVal) return direction === "asc" ? 1 : -1;
         return 0;
       case "usdVal":
-        aVal = a._usdValue || 0;
+        aVal = false;
         bVal = b._usdValue || 0;
         break;
killedBy: sortOrders sorts usdVal numerically
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2000
Received: 5000

[Survived] ConditionalExpression
lib.js:554:16
         return 0;
       case "usdVal":
         aVal = a._usdValue || 0;
-        bVal = b._usdValue || 0;
+        bVal = false;
         break;
       case "price":

[Survived] ConditionalExpression
lib.js:554:16
         return 0;
       case "usdVal":
         aVal = a._usdValue || 0;
-        bVal = b._usdValue || 0;
+        bVal = true;
         break;
       case "price":

[Killed] ConditionalExpression
lib.js:556:7
         aVal = a._usdValue || 0;
         bVal = b._usdValue || 0;
         break;
-      case "price":
-        aVal = a._price || 0;
-        bVal = b._price || 0;
-        break;
+      case "price":
       default:
         return 0;
killedBy: sortOrders sorts price numerically
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 3500

[Killed] LogicalOperator
lib.js:557:16
         bVal = b._usdValue || 0;
         break;
       case "price":
-        aVal = a._price || 0;
+        aVal = a._price && 0;
         bVal = b._price || 0;
         break;
killedBy: sortOrders sorts price numerically
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.0005
Received: 1

[Killed] ConditionalExpression
lib.js:557:16
         bVal = b._usdValue || 0;
         break;
       case "price":
-        aVal = a._price || 0;
+        aVal = false;
         bVal = b._price || 0;
         break;
killedBy: sortOrders sorts price numerically
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0.0005
Received: 1

[Killed] ConditionalExpression
lib.js:558:16
         break;
       case "price":
         aVal = a._price || 0;
-        bVal = b._price || 0;
+        bVal = true;
         break;
       default:
killedBy: sortOrders sorts price numerically
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 3500

[Killed] ConditionalExpression
lib.js:558:16
         break;
       case "price":
         aVal = a._price || 0;
-        bVal = b._price || 0;
+        bVal = false;
         break;
       default:
killedBy: sortOrders sorts price numerically
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 3500

[Survived] ConditionalExpression
lib.js:560:7
         aVal = a._price || 0;
         bVal = b._price || 0;
         break;
-      default:
-        return 0;
+      default:
     }
 

[Killed] ConditionalExpression
lib.js:564:29
         return 0;
     }
 
-    if (aVal < bVal) return direction === "asc" ? -1 : 1;
+    if (aVal < bVal) return true ? -1 : 1;
     if (aVal > bVal) return direction === "asc" ? 1 : -1;
     return 0;
killedBy: sortOrders respects sort direction
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: "2"

[Killed] EqualityOperator
lib.js:564:9
         return 0;
     }
 
-    if (aVal < bVal) return direction === "asc" ? -1 : 1;
+    if (aVal <= bVal) return direction === "asc" ? -1 : 1;
     if (aVal > bVal) return direction === "asc" ? 1 : -1;
     return 0;
killedBy: sortOrders returns 0 for equal values (stable sort)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: "2"

[Killed] ConditionalExpression
lib.js:565:29
     }
 
     if (aVal < bVal) return direction === "asc" ? -1 : 1;
-    if (aVal > bVal) return direction === "asc" ? 1 : -1;
+    if (aVal > bVal) return false ? 1 : -1;
     return 0;
   });
killedBy: sortOrders sorts orderId numerically
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
+   "10",
+   "3",

[Killed] UnaryOperator
lib.js:565:55
     }
 
     if (aVal < bVal) return direction === "asc" ? -1 : 1;
-    if (aVal > bVal) return direction === "asc" ? 1 : -1;
+    if (aVal > bVal) return direction === "asc" ? 1 : +1;
     return 0;
   });
killedBy: sortOrders respects sort direction
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "3"
Received: "2"

[Killed] BlockStatement
lib.js:603:36
  * @param {string} data - Error data hex string
  * @returns {{name: string, message: string}|null}
  */
-function decodeContractError(data) {
-  if (!data || typeof data !== "string") return null;
-
-  const selector = data.slice(0, 10).toLowerCase();
-  const errorName = ERROR_SIGNATURES[selector];
-
-  if (errorName) {
-    return {
-      name: errorName,
-      message: ERROR_MESSAGES[errorName] || errorName,
-    };
-  }
-
-  return null;
-}
+function decodeContractError(data) {}
 
 /**
killedBy: decodeContractError maps selector 0xd92e233d to ZeroAddress
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] LogicalOperator
lib.js:604:7
  * @returns {{name: string, message: string}|null}
  */
 function decodeContractError(data) {
-  if (!data || typeof data !== "string") return null;
+  if (!data && typeof data !== "string") return null;
 
   const selector = data.slice(0, 10).toLowerCase();
killedBy: decodeContractError returns null for invalid input
statusReason: TypeError: data.slice is not a function

[Killed] BooleanLiteral
lib.js:604:7
  * @returns {{name: string, message: string}|null}
  */
 function decodeContractError(data) {
-  if (!data || typeof data !== "string") return null;
+  if (data || typeof data !== "string") return null;
 
   const selector = data.slice(0, 10).toLowerCase();
killedBy: decodeContractError maps selector 0xd92e233d to ZeroAddress
statusReason: TypeError: Cannot read properties of null (reading 'name')

[Killed] MethodExpression
lib.js:606:20
 function decodeContractError(data) {
   if (!data || typeof data !== "string") return null;
 
-  const selector = data.slice(0, 10).toLowerCase();
+  const selector = data.slice(0, 10).toUpperCase();
   const errorName = ERROR_SIGNATURES[selector];
 
killedBy: decodeContractError maps selector 0xd92e233d to ZeroAddress
statusReason: TypeError: Cannot read properties of null (reading 'name')

[Killed] MethodExpression
lib.js:606:20
 function decodeContractError(data) {
   if (!data || typeof data !== "string") return null;
 
-  const selector = data.slice(0, 10).toLowerCase();
+  const selector = data.toLowerCase();
   const errorName = ERROR_SIGNATURES[selector];
 
killedBy: decodeContractError handles selector with ABI-encoded parameters
statusReason: TypeError: Cannot read properties of null (reading 'name')

[Killed] ConditionalExpression
lib.js:609:7
   const selector = data.slice(0, 10).toLowerCase();
   const errorName = ERROR_SIGNATURES[selector];
 
-  if (errorName) {
+  if (true) {
     return {
       name: errorName,
killedBy: decodeContractError returns null for unknown selector
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: {"message": undefined, "name": undefined}

[Killed] ConditionalExpression
lib.js:609:7
   const selector = data.slice(0, 10).toLowerCase();
   const errorName = ERROR_SIGNATURES[selector];
 
-  if (errorName) {
+  if (false) {
     return {
       name: errorName,
killedBy: decodeContractError maps selector 0xd92e233d to ZeroAddress
statusReason: TypeError: Cannot read properties of null (reading 'name')

[Killed] ObjectLiteral
lib.js:610:12
   const errorName = ERROR_SIGNATURES[selector];
 
   if (errorName) {
-    return {
-      name: errorName,
-      message: ERROR_MESSAGES[errorName] || errorName,
-    };
+    return {};
   }
 
killedBy: decodeContractError maps selector 0xd92e233d to ZeroAddress
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ZeroAddress"
Received: undefined

[Killed] ConditionalExpression
lib.js:612:16
   if (errorName) {
     return {
       name: errorName,
-      message: ERROR_MESSAGES[errorName] || errorName,
+      message: false,
     };
   }
killedBy: decodeContractError maps selector 0xd92e233d to ZeroAddress
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Token address cannot be zero"
Received: false

[Killed] LogicalOperator
lib.js:612:16
   if (errorName) {
     return {
       name: errorName,
-      message: ERROR_MESSAGES[errorName] || errorName,
+      message: ERROR_MESSAGES[errorName] && errorName,
     };
   }
killedBy: decodeContractError maps selector 0xd92e233d to ZeroAddress
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Token address cannot be zero"
Received: "ZeroAddress"

[Killed] ConditionalExpression
lib.js:626:7
  */
 function parseContractError(e) {
   // Check for revert data
-  if (e.data) {
+  if (false) {
     const decoded = decodeContractError(e.data);
     if (decoded) return decoded.message;
killedBy: parseContractError extracts error from e.data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Token address cannot be zero"
Received: "Transaction failed"

[Killed] BlockStatement
lib.js:626:15
  */
 function parseContractError(e) {
   // Check for revert data
-  if (e.data) {
-    const decoded = decodeContractError(e.data);
-    if (decoded) return decoded.message;
-  }
+  if (e.data) {}
 
   // Check info.error for nested errors
killedBy: parseContractError extracts error from e.data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Token address cannot be zero"
Received: "Transaction failed"

[Killed] ConditionalExpression
lib.js:628:9
   // Check for revert data
   if (e.data) {
     const decoded = decodeContractError(e.data);
-    if (decoded) return decoded.message;
+    if (false) return decoded.message;
   }
 
killedBy: parseContractError extracts error from e.data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Token address cannot be zero"
Received: "Transaction failed"

[Survived] ConditionalExpression
lib.js:628:9
   // Check for revert data
   if (e.data) {
     const decoded = decodeContractError(e.data);
-    if (decoded) return decoded.message;
+    if (true) return decoded.message;
   }
 

[Killed] OptionalChaining
lib.js:632:7
   }
 
   // Check info.error for nested errors
-  if (e.info?.error?.data) {
+  if (e.info.error?.data) {
     const decoded = decodeContractError(e.info.error.data);
     if (decoded) return decoded.message;
killedBy: parseContractError handles user rejection code 4001
statusReason: TypeError: Cannot read properties of undefined (reading 'error')

[Killed] BlockStatement
lib.js:632:28
   }
 
   // Check info.error for nested errors
-  if (e.info?.error?.data) {
-    const decoded = decodeContractError(e.info.error.data);
-    if (decoded) return decoded.message;
-  }
+  if (e.info?.error?.data) {}
 
   // User rejection
killedBy: parseContractError extracts error from e.info.error.data (ethers v6)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Amount cannot be zero"
Received: "Transaction failed"

[Killed] ConditionalExpression
lib.js:634:9
   // Check info.error for nested errors
   if (e.info?.error?.data) {
     const decoded = decodeContractError(e.info.error.data);
-    if (decoded) return decoded.message;
+    if (false) return decoded.message;
   }
 
killedBy: parseContractError extracts error from e.info.error.data (ethers v6)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Amount cannot be zero"
Received: "Transaction failed"

[Survived] ConditionalExpression
lib.js:634:9
   // Check info.error for nested errors
   if (e.info?.error?.data) {
     const decoded = decodeContractError(e.info.error.data);
-    if (decoded) return decoded.message;
+    if (true) return decoded.message;
   }
 

[Killed] EqualityOperator
lib.js:638:26
   }
 
   // User rejection
-  if (e.code === 4001 || e.code === "ACTION_REJECTED") {
+  if (e.code === 4001 || e.code !== "ACTION_REJECTED") {
     return "Transaction rejected by user";
   }
killedBy: parseContractError handles ACTION_REJECTED string code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Transaction rejected by user"
Received: "Transaction failed"

[Killed] EqualityOperator
lib.js:638:7
   }
 
   // User rejection
-  if (e.code === 4001 || e.code === "ACTION_REJECTED") {
+  if (e.code !== 4001 || e.code === "ACTION_REJECTED") {
     return "Transaction rejected by user";
   }
killedBy: parseContractError handles user rejection code 4001
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Transaction rejected by user"
Received: "Transaction failed"

[Killed] UnaryOperator
lib.js:643:18
   }
 
   // Insufficient funds
-  if (e.code === -32000 || e.message?.includes("insufficient funds")) {
+  if (e.code === +32000 || e.message?.includes("insufficient funds")) {
     return "Insufficient funds for transaction";
   }
killedBy: parseContractError handles insufficient funds code -32000
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Insufficient funds for transaction"
Received: "Transaction failed"

[Killed] LogicalOperator
lib.js:643:7
   }
 
   // Insufficient funds
-  if (e.code === -32000 || e.message?.includes("insufficient funds")) {
+  if (e.code === -32000 && e.message?.includes("insufficient funds")) {
     return "Insufficient funds for transaction";
   }
killedBy: parseContractError handles insufficient funds code -32000
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Insufficient funds for transaction"
Received: "Transaction failed"

[Killed] StringLiteral
lib.js:644:12
 
   // Insufficient funds
   if (e.code === -32000 || e.message?.includes("insufficient funds")) {
-    return "Insufficient funds for transaction";
+    return "";
   }
 
killedBy: parseContractError handles insufficient funds code -32000
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Insufficient funds for transaction"
Received: ""

[Killed] BlockStatement
lib.js:648:50
   }
 
   // Gas estimation failures
-  if (e.message?.includes("execution reverted")) {
-    const match = e.message.match(/reason="([^"]+)"/);
-    if (match) return match[1];
-    return "Transaction would fail";
-  }
+  if (e.message?.includes("execution reverted")) {}
 
   // Default
killedBy: parseContractError extracts reason from execution reverted message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Custom error"
Received: "execution reverted: reason=\"Custom error\""

[Killed] OptionalChaining
lib.js:648:7
   }
 
   // Gas estimation failures
-  if (e.message?.includes("execution reverted")) {
+  if (e.message.includes("execution reverted")) {
     const match = e.message.match(/reason="([^"]+)"/);
     if (match) return match[1];
killedBy: parseContractError returns generic message for unknown error
statusReason: TypeError: Cannot read properties of undefined (reading 'includes')

[Killed] ConditionalExpression
lib.js:650:9
   // Gas estimation failures
   if (e.message?.includes("execution reverted")) {
     const match = e.message.match(/reason="([^"]+)"/);
-    if (match) return match[1];
+    if (true) return match[1];
     return "Transaction would fail";
   }
killedBy: parseContractError returns fallback for execution reverted without reason
statusReason: TypeError: Cannot read properties of null (reading '1')

[Killed] ConditionalExpression
lib.js:650:9
   // Gas estimation failures
   if (e.message?.includes("execution reverted")) {
     const match = e.message.match(/reason="([^"]+)"/);
-    if (match) return match[1];
+    if (false) return match[1];
     return "Transaction would fail";
   }
killedBy: parseContractError extracts reason from execution reverted message
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Custom error"
Received: "Transaction would fail"

[Killed] StringLiteral
lib.js:651:12
   if (e.message?.includes("execution reverted")) {
     const match = e.message.match(/reason="([^"]+)"/);
     if (match) return match[1];
-    return "Transaction would fail";
+    return "";
   }
 
killedBy: parseContractError returns fallback for execution reverted without reason
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Transaction would fail"
Received: ""

[Killed] ConditionalExpression
lib.js:655:10
   }
 
   // Default
-  return e.shortMessage || e.message || "Transaction failed";
+  return true;
 }
 
killedBy: parseContractError returns generic message for unknown error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Transaction failed"
Received: true

[Killed] ConditionalExpression
lib.js:655:10
   }
 
   // Default
-  return e.shortMessage || e.message || "Transaction failed";
+  return false;
 }
 
killedBy: parseContractError returns generic message for unknown error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Transaction failed"
Received: false

[Killed] BlockStatement
lib.js:668:42
  * @param {boolean} isLocal - Whether running in local/dev mode
  * @returns {{valid: boolean, errors: string[]}}
  */
-function validateConfig(config, isLocal) {
-  if (isLocal) {
-    return { valid: true, errors: [] };
-  }
-
-  const errors = [];
-  if (config.CONTRACT_ADDRESS === "0x0000000000000000000000000000000000000000") {
-    errors.push("CONTRACT_ADDRESS is not configured");
-  }
-  if (config.SUBGRAPH_URL.includes("YOUR_ID")) {
-    errors.push("SUBGRAPH_URL is not configured");
-  }
-
-  return { valid: errors.length === 0, errors };
-}
+function validateConfig(config, isLocal) {}
 
 // ============================================================================
killedBy: validateConfig skips validation in local mode
statusReason: TypeError: Cannot read properties of undefined (reading 'valid')

[Killed] BlockStatement
lib.js:669:16
  * @returns {{valid: boolean, errors: string[]}}
  */
 function validateConfig(config, isLocal) {
-  if (isLocal) {
-    return { valid: true, errors: [] };
-  }
+  if (isLocal) {}
 
   const errors = [];
killedBy: validateConfig skips validation in local mode
statusReason: TypeError: Cannot read properties of undefined (reading 'includes')

[Killed] ConditionalExpression
lib.js:669:7
  * @returns {{valid: boolean, errors: string[]}}
  */
 function validateConfig(config, isLocal) {
-  if (isLocal) {
+  if (true) {
     return { valid: true, errors: [] };
   }
killedBy: validateConfig rejects zero address for contract
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
lib.js:670:21
  */
 function validateConfig(config, isLocal) {
   if (isLocal) {
-    return { valid: true, errors: [] };
+    return { valid: false, errors: [] };
   }
 
killedBy: validateConfig skips validation in local mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrayDeclaration
lib.js:673:18
     return { valid: true, errors: [] };
   }
 
-  const errors = [];
+  const errors = ["Stryker was here"];
   if (config.CONTRACT_ADDRESS === "0x0000000000000000000000000000000000000000") {
     errors.push("CONTRACT_ADDRESS is not configured");
killedBy: validateConfig reports all errors at once
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] ConditionalExpression
lib.js:674:7
   }
 
   const errors = [];
-  if (config.CONTRACT_ADDRESS === "0x0000000000000000000000000000000000000000") {
+  if (true) {
     errors.push("CONTRACT_ADDRESS is not configured");
   }
killedBy: validateConfig accepts valid configuration
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
