[Killed] ConditionalExpression
lib.js:674:7
   }
 
   const errors = [];
-  if (config.CONTRACT_ADDRESS === "0x0000000000000000000000000000000000000000") {
+  if (false) {
     errors.push("CONTRACT_ADDRESS is not configured");
   }
killedBy: validateConfig rejects zero address for contract
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
lib.js:677:48
   if (config.CONTRACT_ADDRESS === "0x0000000000000000000000000000000000000000") {
     errors.push("CONTRACT_ADDRESS is not configured");
   }
-  if (config.SUBGRAPH_URL.includes("YOUR_ID")) {
-    errors.push("SUBGRAPH_URL is not configured");
-  }
+  if (config.SUBGRAPH_URL.includes("YOUR_ID")) {}
 
   return { valid: errors.length === 0, errors };
killedBy: validateConfig rejects placeholder in subgraph URL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
lib.js:677:7
   if (config.CONTRACT_ADDRESS === "0x0000000000000000000000000000000000000000") {
     errors.push("CONTRACT_ADDRESS is not configured");
   }
-  if (config.SUBGRAPH_URL.includes("YOUR_ID")) {
+  if (true) {
     errors.push("SUBGRAPH_URL is not configured");
   }
killedBy: validateConfig accepts valid configuration
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
lib.js:678:17
     errors.push("CONTRACT_ADDRESS is not configured");
   }
   if (config.SUBGRAPH_URL.includes("YOUR_ID")) {
-    errors.push("SUBGRAPH_URL is not configured");
+    errors.push("");
   }
 
killedBy: validateConfig rejects placeholder in subgraph URL
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "SUBGRAPH_URL is not configured"
Received array: [""]
